Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x2c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <d>   DW_AT_stmt_list   : 0
    <11>   DW_AT_ranges      : 0xc
    <15>   DW_AT_name        : (indirect string, offset: 0): ../Application/Startup/startup_stm32g474retx.s
    <19>   DW_AT_comp_dir    : (indirect string, offset: 0x2f): C:/Users/MAREO/STM32CubeIDE/stm32g474_examples/HRTIM_Basic_SinglePWM/STM32CubeIDE/Debug
    <1d>   DW_AT_producer    : (indirect string, offset: 0x87): GNU AS 2.40.0
    <21>   DW_AT_language    : 32769	(MIPS assembler)
 <1><23>: Abbrev Number: 2 (DW_TAG_subprogram)
    <24>   DW_AT_name        : (indirect string, offset: 0x95): Reset_Handler
    <28>   DW_AT_type        : <0x2e>
    <29>   DW_AT_low_pc      : 0x8000219
    <2d>   DW_AT_high_pc     : 56
 <1><2e>: Abbrev Number: 3 (DW_TAG_unspecified_type)
 <1><2f>: Abbrev Number: 0
  Compilation Unit @ offset 0x30:
   Length:        0x19df (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x24
   Pointer Size:  4
 <0><3c>: Abbrev Number: 25 (DW_TAG_compile_unit)

    <2f5>   DW_AT_name        : (indirect string, offset: 0xa63d0): FMAC_IRQn
    <2f9>   DW_AT_const_value : 101
 <2><2fa>: Abbrev Number: 0
 <1><2fb>: Abbrev Number: 11 (DW_TAG_base_type)
    <2fc>   DW_AT_byte_size   : 1
    <2fd>   DW_AT_encoding    : 6	(signed char)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x83230): signed char
 <1><302>: Abbrev Number: 5 (DW_TAG_typedef)
    <303>   DW_AT_name        : (indirect string, offset: 0xf86f8): IRQn_Type
    <307>   DW_AT_decl_file   : 2
    <308>   DW_AT_decl_line   : 179
    <309>   DW_AT_decl_column : 3
    <30a>   DW_AT_type        : <0x5a>
 <1><30e>: Abbrev Number: 5 (DW_TAG_typedef)
    <30f>   DW_AT_name        : (indirect string, offset: 0x4ccfe): __uint8_t
    <313>   DW_AT_decl_file   : 3
    <314>   DW_AT_decl_line   : 43
    <315>   DW_AT_decl_column : 24
    <316>   DW_AT_type        : <0x31a>
 <1><31a>: Abbrev Number: 11 (DW_TAG_base_type)
    <31b>   DW_AT_byte_size   : 1
    <31c>   DW_AT_encoding    : 8	(unsigned char)
    <31d>   DW_AT_name        : (indirect string, offset: 0x36642): unsigned char
 <1><321>: Abbrev Number: 11 (DW_TAG_base_type)
    <322>   DW_AT_byte_size   : 2
    <323>   DW_AT_encoding    : 5	(signed)
    <324>   DW_AT_name        : (indirect string, offset: 0xc0691): short int
 <1><328>: Abbrev Number: 5 (DW_TAG_typedef)
    <329>   DW_AT_name        : (indirect string, offset: 0x7a055): __uint16_t
    <32d>   DW_AT_decl_file   : 3
    <32e>   DW_AT_decl_line   : 57
    <32f>   DW_AT_decl_column : 25
    <330>   DW_AT_type        : <0x334>
 <1><334>: Abbrev Number: 11 (DW_TAG_base_type)
    <335>   DW_AT_byte_size   : 2
    <336>   DW_AT_encoding    : 7	(unsigned)
    <337>   DW_AT_name        : (indirect string, offset: 0x5525c): short unsigned int
 <1><33b>: Abbrev Number: 5 (DW_TAG_typedef)
    <33c>   DW_AT_name        : (indirect string, offset: 0xa0ab1): __int32_t
    <340>   DW_AT_decl_file   : 3
    <341>   DW_AT_decl_line   : 77
    <342>   DW_AT_decl_column : 24
    <343>   DW_AT_type        : <0x347>
 <1><347>: Abbrev Number: 11 (DW_TAG_base_type)
    <348>   DW_AT_byte_size   : 4
    <349>   DW_AT_encoding    : 5	(signed)
    <34a>   DW_AT_name        : (indirect string, offset: 0x17179): long int
 <1><34e>: Abbrev Number: 5 (DW_TAG_typedef)
    <34f>   DW_AT_name        : (indirect string, offset: 0xa5b20): __uint32_t
    <353>   DW_AT_decl_file   : 3
    <354>   DW_AT_decl_line   : 79
    <355>   DW_AT_decl_column : 25
    <356>   DW_AT_type        : <0x35a>
 <1><35a>: Abbrev Number: 11 (DW_TAG_base_type)
    <35b>   DW_AT_byte_size   : 4
    <35c>   DW_AT_encoding    : 7	(unsigned)
    <35d>   DW_AT_name        : (indirect string, offset: 0x3e79d): long unsigned int
 <1><361>: Abbrev Number: 11 (DW_TAG_base_type)
    <362>   DW_AT_byte_size   : 8
    <363>   DW_AT_encoding    : 5	(signed)
    <364>   DW_AT_name        : (indirect string, offset: 0x7761a): long long int
 <1><368>: Abbrev Number: 5 (DW_TAG_typedef)
    <369>   DW_AT_name        : (indirect string, offset: 0x78757): __uint64_t
    <36d>   DW_AT_decl_file   : 3
    <36e>   DW_AT_decl_line   : 105
    <36f>   DW_AT_decl_column : 25
    <370>   DW_AT_type        : <0x374>
 <1><374>: Abbrev Number: 11 (DW_TAG_base_type)
    <375>   DW_AT_byte_size   : 8
    <376>   DW_AT_encoding    : 7	(unsigned)
    <377>   DW_AT_name        : (indirect string, offset: 0x37946): long long unsigned int
 <1><37b>: Abbrev Number: 26 (DW_TAG_base_type)
    <37c>   DW_AT_byte_size   : 4
    <37d>   DW_AT_encoding    : 5	(signed)
    <37e>   DW_AT_name        : int
 <1><382>: Abbrev Number: 11 (DW_TAG_base_type)
    <383>   DW_AT_byte_size   : 4
    <384>   DW_AT_encoding    : 7	(unsigned)
    <385>   DW_AT_name        : (indirect string, offset: 0x165ec): unsigned int
 <1><389>: Abbrev Number: 5 (DW_TAG_typedef)
    <38a>   DW_AT_name        : (indirect string, offset: 0x4cd00): uint8_t
    <38e>   DW_AT_decl_file   : 4
    <38f>   DW_AT_decl_line   : 24
    <390>   DW_AT_decl_column : 19
    <391>   DW_AT_type        : <0x30e>
 <1><395>: Abbrev Number: 5 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0x7a057): uint16_t
    <39a>   DW_AT_decl_file   : 4
    <39b>   DW_AT_decl_line   : 36
    <39c>   DW_AT_decl_column : 20
    <39d>   DW_AT_type        : <0x328>
 <1><3a1>: Abbrev Number: 5 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xa0ab3): int32_t
    <3a6>   DW_AT_decl_file   : 4
    <3a7>   DW_AT_decl_line   : 44
    <3a8>   DW_AT_decl_column : 19
    <3a9>   DW_AT_type        : <0x33b>
 <1><3ad>: Abbrev Number: 5 (DW_TAG_typedef)
    <3ae>   DW_AT_name        : (indirect string, offset: 0xa5b22): uint32_t
    <3b2>   DW_AT_decl_file   : 4
    <3b3>   DW_AT_decl_line   : 48
    <3b4>   DW_AT_decl_column : 20
    <3b5>   DW_AT_type        : <0x34e>
 <1><3b9>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <3ba>   DW_AT_type        : <0x3ad>
 <1><3be>: Abbrev Number: 5 (DW_TAG_typedef)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x78759): uint64_t
    <3c3>   DW_AT_decl_file   : 4
    <3c4>   DW_AT_decl_line   : 60
    <3c5>   DW_AT_decl_column : 20
    <3c6>   DW_AT_type        : <0x368>
 <1><3ca>: Abbrev Number: 16 (DW_TAG_array_type)
    <3cb>   DW_AT_type        : <0x3b9>
    <3cf>   DW_AT_sibling     : <0x3da>
 <2><3d3>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <3d4>   DW_AT_type        : <0x382>
    <3d8>   DW_AT_upper_bound : 1
 <2><3d9>: Abbrev Number: 0
 <1><3da>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <3db>   DW_AT_type        : <0x3ca>
 <1><3df>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e0>   DW_AT_byte_size   : 16
    <3e1>   DW_AT_decl_file   : 2
    <3e2>   DW_AT_decl_line   : 390
    <3e4>   DW_AT_decl_column : 9
    <3e4>   DW_AT_sibling     : <0x420>
 <2><3e8>: Abbrev Number: 7 (DW_TAG_member)
    <3e9>   DW_AT_name        : CCR
    <3ed>   DW_AT_decl_file   : 2
    <3ed>   DW_AT_decl_line   : 392
    <3ef>   DW_AT_decl_column : 17
    <3f0>   DW_AT_type        : <0x3b9>
    <3f4>   DW_AT_data_member_location: 0
 <2><3f5>: Abbrev Number: 1 (DW_TAG_member)
    <3f6>   DW_AT_name        : (indirect string, offset: 0xa9927): CNDTR
    <3fa>   DW_AT_decl_file   : 2
    <3fb>   DW_AT_decl_line   : 393
    <3fd>   DW_AT_decl_column : 17
    <3fe>   DW_AT_type        : <0x3b9>
    <402>   DW_AT_data_member_location: 4
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xf878b): CPAR
    <408>   DW_AT_decl_file   : 2
    <409>   DW_AT_decl_line   : 394
    <40b>   DW_AT_decl_column : 17
    <40c>   DW_AT_type        : <0x3b9>
    <410>   DW_AT_data_member_location: 8
 <2><411>: Abbrev Number: 1 (DW_TAG_member)
    <412>   DW_AT_name        : (indirect string, offset: 0x9014d): CMAR
    <416>   DW_AT_decl_file   : 2
    <417>   DW_AT_decl_line   : 395
    <419>   DW_AT_decl_column : 17
    <41a>   DW_AT_type        : <0x3b9>
    <41e>   DW_AT_data_member_location: 12
 <2><41f>: Abbrev Number: 0
 <1><420>: Abbrev Number: 8 (DW_TAG_typedef)
    <421>   DW_AT_name        : (indirect string, offset: 0xf2f8d): DMA_Channel_TypeDef
    <425>   DW_AT_decl_file   : 2
    <426>   DW_AT_decl_line   : 396
    <428>   DW_AT_decl_column : 3
    <429>   DW_AT_type        : <0x3df>
 <1><42d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <42e>   DW_AT_byte_size   : 8
    <42f>   DW_AT_decl_file   : 2
    <430>   DW_AT_decl_line   : 398
    <432>   DW_AT_decl_column : 9
    <432>   DW_AT_sibling     : <0x452>
 <2><436>: Abbrev Number: 7 (DW_TAG_member)
    <437>   DW_AT_name        : ISR
    <43b>   DW_AT_decl_file   : 2
    <43b>   DW_AT_decl_line   : 400
    <43d>   DW_AT_decl_column : 17
    <43e>   DW_AT_type        : <0x3b9>
    <442>   DW_AT_data_member_location: 0
 <2><443>: Abbrev Number: 1 (DW_TAG_member)
    <444>   DW_AT_name        : (indirect string, offset: 0xb6166): IFCR
    <448>   DW_AT_decl_file   : 2
    <449>   DW_AT_decl_line   : 401
    <44b>   DW_AT_decl_column : 17
    <44c>   DW_AT_type        : <0x3b9>
    <450>   DW_AT_data_member_location: 4
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 8 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0x5f9b4): DMA_TypeDef
    <457>   DW_AT_decl_file   : 2
    <458>   DW_AT_decl_line   : 402
    <45a>   DW_AT_decl_column : 3
    <45b>   DW_AT_type        : <0x42d>
 <1><45f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <460>   DW_AT_byte_size   : 4
    <461>   DW_AT_decl_file   : 2
    <462>   DW_AT_decl_line   : 408
    <464>   DW_AT_decl_column : 9
    <464>   DW_AT_sibling     : <0x476>
 <2><468>: Abbrev Number: 7 (DW_TAG_member)
    <469>   DW_AT_name        : CCR
    <46d>   DW_AT_decl_file   : 2
    <46d>   DW_AT_decl_line   : 410
    <46f>   DW_AT_decl_column : 19
    <470>   DW_AT_type        : <0x3b9>
    <474>   DW_AT_data_member_location: 0
 <2><475>: Abbrev Number: 0
 <1><476>: Abbrev Number: 8 (DW_TAG_typedef)
    <477>   DW_AT_name        : (indirect string, offset: 0x6e060): DMAMUX_Channel_TypeDef
    <47b>   DW_AT_decl_file   : 2
    <47c>   DW_AT_decl_line   : 411
    <47e>   DW_AT_decl_column : 2
    <47f>   DW_AT_type        : <0x45f>
 <1><483>: Abbrev Number: 10 (DW_TAG_structure_type)
    <484>   DW_AT_byte_size   : 8
    <485>   DW_AT_decl_file   : 2
    <486>   DW_AT_decl_line   : 413
    <488>   DW_AT_decl_column : 9
    <488>   DW_AT_sibling     : <0x4a7>
 <2><48c>: Abbrev Number: 7 (DW_TAG_member)
    <48d>   DW_AT_name        : CSR
    <491>   DW_AT_decl_file   : 2
    <491>   DW_AT_decl_line   : 415
    <493>   DW_AT_decl_column : 19
    <494>   DW_AT_type        : <0x3b9>
    <498>   DW_AT_data_member_location: 0
 <2><499>: Abbrev Number: 7 (DW_TAG_member)
    <49a>   DW_AT_name        : CFR
    <49e>   DW_AT_decl_file   : 2
    <49e>   DW_AT_decl_line   : 416
    <4a0>   DW_AT_decl_column : 19
    <4a1>   DW_AT_type        : <0x3b9>
    <4a5>   DW_AT_data_member_location: 4
 <2><4a6>: Abbrev Number: 0
 <1><4a7>: Abbrev Number: 8 (DW_TAG_typedef)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xf3858): DMAMUX_ChannelStatus_TypeDef
    <4ac>   DW_AT_decl_file   : 2
    <4ad>   DW_AT_decl_line   : 417
    <4af>   DW_AT_decl_column : 2
    <4b0>   DW_AT_type        : <0x483>
 <1><4b4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <4b5>   DW_AT_byte_size   : 4
    <4b6>   DW_AT_decl_file   : 2
    <4b7>   DW_AT_decl_line   : 419
    <4b9>   DW_AT_decl_column : 9
    <4b9>   DW_AT_sibling     : <0x4cc>
 <2><4bd>: Abbrev Number: 1 (DW_TAG_member)
    <4be>   DW_AT_name        : (indirect string, offset: 0x78003): RGCR
    <4c2>   DW_AT_decl_file   : 2
    <4c3>   DW_AT_decl_line   : 421
    <4c5>   DW_AT_decl_column : 19
    <4c6>   DW_AT_type        : <0x3b9>
    <4ca>   DW_AT_data_member_location: 0
 <2><4cb>: Abbrev Number: 0
 <1><4cc>: Abbrev Number: 8 (DW_TAG_typedef)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x99e7d): DMAMUX_RequestGen_TypeDef
    <4d1>   DW_AT_decl_file   : 2
    <4d2>   DW_AT_decl_line   : 422
    <4d4>   DW_AT_decl_column : 2
    <4d5>   DW_AT_type        : <0x4b4>
 <1><4d9>: Abbrev Number: 10 (DW_TAG_structure_type)
    <4da>   DW_AT_byte_size   : 8
    <4db>   DW_AT_decl_file   : 2
    <4dc>   DW_AT_decl_line   : 424
    <4de>   DW_AT_decl_column : 9
    <4de>   DW_AT_sibling     : <0x4ff>
 <2><4e2>: Abbrev Number: 1 (DW_TAG_member)
    <4e3>   DW_AT_name        : (indirect string, offset: 0x89a5f): RGSR
    <4e7>   DW_AT_decl_file   : 2
    <4e8>   DW_AT_decl_line   : 426
    <4ea>   DW_AT_decl_column : 19
    <4eb>   DW_AT_type        : <0x3b9>
    <4ef>   DW_AT_data_member_location: 0
 <2><4f0>: Abbrev Number: 1 (DW_TAG_member)
    <4f1>   DW_AT_name        : (indirect string, offset: 0x32c): RGCFR
    <4f5>   DW_AT_decl_file   : 2
    <4f6>   DW_AT_decl_line   : 427
    <4f8>   DW_AT_decl_column : 19
    <4f9>   DW_AT_type        : <0x3b9>
    <4fd>   DW_AT_data_member_location: 4
 <2><4fe>: Abbrev Number: 0
 <1><4ff>: Abbrev Number: 8 (DW_TAG_typedef)
    <500>   DW_AT_name        : (indirect string, offset: 0x361a4): DMAMUX_RequestGenStatus_TypeDef
    <504>   DW_AT_decl_file   : 2
    <505>   DW_AT_decl_line   : 428
    <507>   DW_AT_decl_column : 2
    <508>   DW_AT_type        : <0x4d9>
 <1><50c>: Abbrev Number: 10 (DW_TAG_structure_type)
    <50d>   DW_AT_byte_size   : 44
    <50e>   DW_AT_decl_file   : 2
    <50f>   DW_AT_decl_line   : 533
    <511>   DW_AT_decl_column : 9
    <511>   DW_AT_sibling     : <0x59e>
 <2><515>: Abbrev Number: 1 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x1870): MODER
    <51a>   DW_AT_decl_file   : 2
    <51b>   DW_AT_decl_line   : 535
    <51d>   DW_AT_decl_column : 17
    <51e>   DW_AT_type        : <0x3b9>
    <522>   DW_AT_data_member_location: 0
 <2><523>: Abbrev Number: 1 (DW_TAG_member)
    <524>   DW_AT_name        : (indirect string, offset: 0xc7a9b): OTYPER
    <528>   DW_AT_decl_file   : 2
    <529>   DW_AT_decl_line   : 536
    <52b>   DW_AT_decl_column : 17
    <52c>   DW_AT_type        : <0x3b9>
    <530>   DW_AT_data_member_location: 4
 <2><531>: Abbrev Number: 1 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0xdfe91): OSPEEDR
    <536>   DW_AT_decl_file   : 2
    <537>   DW_AT_decl_line   : 537
    <539>   DW_AT_decl_column : 17
    <53a>   DW_AT_type        : <0x3b9>
    <53e>   DW_AT_data_member_location: 8
 <2><53f>: Abbrev Number: 1 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0xb93f9): PUPDR
    <544>   DW_AT_decl_file   : 2
    <545>   DW_AT_decl_line   : 538
    <547>   DW_AT_decl_column : 17
    <548>   DW_AT_type        : <0x3b9>
    <54c>   DW_AT_data_member_location: 12
 <2><54d>: Abbrev Number: 7 (DW_TAG_member)
    <54e>   DW_AT_name        : IDR
    <552>   DW_AT_decl_file   : 2
    <552>   DW_AT_decl_line   : 539
    <554>   DW_AT_decl_column : 17
    <555>   DW_AT_type        : <0x3b9>
    <559>   DW_AT_data_member_location: 16
 <2><55a>: Abbrev Number: 7 (DW_TAG_member)
    <55b>   DW_AT_name        : ODR
    <55f>   DW_AT_decl_file   : 2
    <55f>   DW_AT_decl_line   : 540
    <561>   DW_AT_decl_column : 17
    <562>   DW_AT_type        : <0x3b9>
    <566>   DW_AT_data_member_location: 20
 <2><567>: Abbrev Number: 1 (DW_TAG_member)
    <568>   DW_AT_name        : (indirect string, offset: 0x3bd86): BSRR
    <56c>   DW_AT_decl_file   : 2
    <56d>   DW_AT_decl_line   : 541
    <56f>   DW_AT_decl_column : 17
    <570>   DW_AT_type        : <0x3b9>
    <574>   DW_AT_data_member_location: 24
 <2><575>: Abbrev Number: 1 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xdce0f): LCKR
    <57a>   DW_AT_decl_file   : 2
    <57b>   DW_AT_decl_line   : 542
    <57d>   DW_AT_decl_column : 17
    <57e>   DW_AT_type        : <0x3b9>
    <582>   DW_AT_data_member_location: 28
 <2><583>: Abbrev Number: 7 (DW_TAG_member)
    <584>   DW_AT_name        : AFR
    <588>   DW_AT_decl_file   : 2
    <588>   DW_AT_decl_line   : 543
    <58a>   DW_AT_decl_column : 17
    <58b>   DW_AT_type        : <0x3da>
    <58f>   DW_AT_data_member_location: 32
 <2><590>: Abbrev Number: 7 (DW_TAG_member)
    <591>   DW_AT_name        : BRR
    <595>   DW_AT_decl_file   : 2
    <595>   DW_AT_decl_line   : 544
    <597>   DW_AT_decl_column : 17
    <598>   DW_AT_type        : <0x3b9>
    <59c>   DW_AT_data_member_location: 40
 <2><59d>: Abbrev Number: 0
 <1><59e>: Abbrev Number: 8 (DW_TAG_typedef)
    <59f>   DW_AT_name        : (indirect string, offset: 0x92170): GPIO_TypeDef
    <5a3>   DW_AT_decl_file   : 2
    <5a4>   DW_AT_decl_line   : 545
    <5a6>   DW_AT_decl_column : 3
    <5a7>   DW_AT_type        : <0x50c>
 <1><5ab>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5ac>   DW_AT_byte_size   : 160
    <5ad>   DW_AT_decl_file   : 2
    <5ae>   DW_AT_decl_line   : 664
    <5b0>   DW_AT_decl_column : 9
    <5b0>   DW_AT_sibling     : <0x7e2>
 <2><5b4>: Abbrev Number: 7 (DW_TAG_member)
    <5b5>   DW_AT_name        : CR
    <5b8>   DW_AT_decl_file   : 2
    <5b8>   DW_AT_decl_line   : 666
    <5ba>   DW_AT_decl_column : 17
    <5bb>   DW_AT_type        : <0x3b9>
    <5bf>   DW_AT_data_member_location: 0
 <2><5c0>: Abbrev Number: 1 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x94ba4): ICSCR
    <5c5>   DW_AT_decl_file   : 2
    <5c6>   DW_AT_decl_line   : 667
    <5c8>   DW_AT_decl_column : 17
    <5c9>   DW_AT_type        : <0x3b9>
    <5cd>   DW_AT_data_member_location: 4
 <2><5ce>: Abbrev Number: 1 (DW_TAG_member)
    <5cf>   DW_AT_name        : (indirect string, offset: 0xb6536): CFGR
    <5d3>   DW_AT_decl_file   : 2
    <5d4>   DW_AT_decl_line   : 668
    <5d6>   DW_AT_decl_column : 17
    <5d7>   DW_AT_type        : <0x3b9>
    <5db>   DW_AT_data_member_location: 8
 <2><5dc>: Abbrev Number: 1 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0xb6533): PLLCFGR
    <5e1>   DW_AT_decl_file   : 2
    <5e2>   DW_AT_decl_line   : 669
    <5e4>   DW_AT_decl_column : 17
    <5e5>   DW_AT_type        : <0x3b9>
    <5e9>   DW_AT_data_member_location: 12
 <2><5ea>: Abbrev Number: 1 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0xf2ee1): RESERVED0
    <5ef>   DW_AT_decl_file   : 2
    <5f0>   DW_AT_decl_line   : 670
    <5f2>   DW_AT_decl_column : 17
    <5f3>   DW_AT_type        : <0x3ad>
    <5f7>   DW_AT_data_member_location: 16
 <2><5f8>: Abbrev Number: 1 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0xf2eeb): RESERVED1
    <5fd>   DW_AT_decl_file   : 2
    <5fe>   DW_AT_decl_line   : 671
    <600>   DW_AT_decl_column : 17
    <601>   DW_AT_type        : <0x3ad>
    <605>   DW_AT_data_member_location: 20
 <2><606>: Abbrev Number: 1 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x2e7f): CIER
    <60b>   DW_AT_decl_file   : 2
    <60c>   DW_AT_decl_line   : 672
    <60e>   DW_AT_decl_column : 17
    <60f>   DW_AT_type        : <0x3b9>
    <613>   DW_AT_data_member_location: 24
 <2><614>: Abbrev Number: 1 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x3732): CIFR
    <619>   DW_AT_decl_file   : 2
    <61a>   DW_AT_decl_line   : 673
    <61c>   DW_AT_decl_column : 17
    <61d>   DW_AT_type        : <0x3b9>
    <621>   DW_AT_data_member_location: 28
 <2><622>: Abbrev Number: 1 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x1dd7): CICR
    <627>   DW_AT_decl_file   : 2
    <628>   DW_AT_decl_line   : 674
    <62a>   DW_AT_decl_column : 17
    <62b>   DW_AT_type        : <0x3b9>
    <62f>   DW_AT_data_member_location: 32
 <2><630>: Abbrev Number: 1 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0xf2ef5): RESERVED2
    <635>   DW_AT_decl_file   : 2
    <636>   DW_AT_decl_line   : 675
    <638>   DW_AT_decl_column : 17
    <639>   DW_AT_type        : <0x3ad>
    <63d>   DW_AT_data_member_location: 36
 <2><63e>: Abbrev Number: 1 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0xcdb02): AHB1RSTR
    <643>   DW_AT_decl_file   : 2
    <644>   DW_AT_decl_line   : 676
    <646>   DW_AT_decl_column : 17
    <647>   DW_AT_type        : <0x3b9>
    <64b>   DW_AT_data_member_location: 40
 <2><64c>: Abbrev Number: 1 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0x1fc07): AHB2RSTR
    <651>   DW_AT_decl_file   : 2
    <652>   DW_AT_decl_line   : 677
    <654>   DW_AT_decl_column : 17
    <655>   DW_AT_type        : <0x3b9>
    <659>   DW_AT_data_member_location: 44
 <2><65a>: Abbrev Number: 1 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x71ee5): AHB3RSTR
    <65f>   DW_AT_decl_file   : 2
    <660>   DW_AT_decl_line   : 678
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0x3b9>
    <667>   DW_AT_data_member_location: 48
 <2><668>: Abbrev Number: 1 (DW_TAG_member)
    <669>   DW_AT_name        : (indirect string, offset: 0xf2eff): RESERVED3
    <66d>   DW_AT_decl_file   : 2
    <66e>   DW_AT_decl_line   : 679
    <670>   DW_AT_decl_column : 17
    <671>   DW_AT_type        : <0x3ad>
    <675>   DW_AT_data_member_location: 52
 <2><676>: Abbrev Number: 1 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x366eb): APB1RSTR1
    <67b>   DW_AT_decl_file   : 2
    <67c>   DW_AT_decl_line   : 680
    <67e>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x3b9>
    <683>   DW_AT_data_member_location: 56
 <2><684>: Abbrev Number: 1 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x256c3): APB1RSTR2
    <689>   DW_AT_decl_file   : 2
    <68a>   DW_AT_decl_line   : 681
    <68c>   DW_AT_decl_column : 17
    <68d>   DW_AT_type        : <0x3b9>
    <691>   DW_AT_data_member_location: 60
 <2><692>: Abbrev Number: 1 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x718cb): APB2RSTR
    <697>   DW_AT_decl_file   : 2
    <698>   DW_AT_decl_line   : 682
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x3b9>
    <69f>   DW_AT_data_member_location: 64
 <2><6a0>: Abbrev Number: 1 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x9b12f): RESERVED4
    <6a5>   DW_AT_decl_file   : 2
    <6a6>   DW_AT_decl_line   : 683
    <6a8>   DW_AT_decl_column : 17
    <6a9>   DW_AT_type        : <0x3ad>
    <6ad>   DW_AT_data_member_location: 68
 <2><6ae>: Abbrev Number: 1 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x165b2): AHB1ENR
    <6b3>   DW_AT_decl_file   : 2
    <6b4>   DW_AT_decl_line   : 684
    <6b6>   DW_AT_decl_column : 17
    <6b7>   DW_AT_type        : <0x3b9>
    <6bb>   DW_AT_data_member_location: 72
 <2><6bc>: Abbrev Number: 1 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x46275): AHB2ENR
    <6c1>   DW_AT_decl_file   : 2
    <6c2>   DW_AT_decl_line   : 685
    <6c4>   DW_AT_decl_column : 17
    <6c5>   DW_AT_type        : <0x3b9>
    <6c9>   DW_AT_data_member_location: 76
 <2><6ca>: Abbrev Number: 1 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x66c7e): AHB3ENR
    <6cf>   DW_AT_decl_file   : 2
    <6d0>   DW_AT_decl_line   : 686
    <6d2>   DW_AT_decl_column : 17
    <6d3>   DW_AT_type        : <0x3b9>
    <6d7>   DW_AT_data_member_location: 80
 <2><6d8>: Abbrev Number: 1 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0xf2f2d): RESERVED5
    <6dd>   DW_AT_decl_file   : 2
    <6de>   DW_AT_decl_line   : 687
    <6e0>   DW_AT_decl_column : 17
    <6e1>   DW_AT_type        : <0x3ad>
    <6e5>   DW_AT_data_member_location: 84
 <2><6e6>: Abbrev Number: 1 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x8bc7): APB1ENR1
    <6eb>   DW_AT_decl_file   : 2
    <6ec>   DW_AT_decl_line   : 688
    <6ee>   DW_AT_decl_column : 17
    <6ef>   DW_AT_type        : <0x3b9>
    <6f3>   DW_AT_data_member_location: 88
 <2><6f4>: Abbrev Number: 1 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x8bd0): APB1ENR2
    <6f9>   DW_AT_decl_file   : 2
    <6fa>   DW_AT_decl_line   : 689
    <6fc>   DW_AT_decl_column : 17
    <6fd>   DW_AT_type        : <0x3b9>
    <701>   DW_AT_data_member_location: 92
 <2><702>: Abbrev Number: 1 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0xc3dc4): APB2ENR
    <707>   DW_AT_decl_file   : 2
    <708>   DW_AT_decl_line   : 690
    <70a>   DW_AT_decl_column : 17
    <70b>   DW_AT_type        : <0x3b9>
    <70f>   DW_AT_data_member_location: 96
 <2><710>: Abbrev Number: 1 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0xf2f37): RESERVED6
    <715>   DW_AT_decl_file   : 2
    <716>   DW_AT_decl_line   : 691
    <718>   DW_AT_decl_column : 17
    <719>   DW_AT_type        : <0x3ad>
    <71d>   DW_AT_data_member_location: 100
 <2><71e>: Abbrev Number: 1 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0x785c7): AHB1SMENR
    <723>   DW_AT_decl_file   : 2
    <724>   DW_AT_decl_line   : 692
    <726>   DW_AT_decl_column : 17
    <727>   DW_AT_type        : <0x3b9>
    <72b>   DW_AT_data_member_location: 104
 <2><72c>: Abbrev Number: 1 (DW_TAG_member)
    <72d>   DW_AT_name        : (indirect string, offset: 0xec7d4): AHB2SMENR
    <731>   DW_AT_decl_file   : 2
    <732>   DW_AT_decl_line   : 693
    <734>   DW_AT_decl_column : 17
    <735>   DW_AT_type        : <0x3b9>
    <739>   DW_AT_data_member_location: 108
 <2><73a>: Abbrev Number: 1 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x5fe60): AHB3SMENR
    <73f>   DW_AT_decl_file   : 2
    <740>   DW_AT_decl_line   : 694
    <742>   DW_AT_decl_column : 17
    <743>   DW_AT_type        : <0x3b9>
    <747>   DW_AT_data_member_location: 112
 <2><748>: Abbrev Number: 1 (DW_TAG_member)
    <749>   DW_AT_name        : (indirect string, offset: 0xf2f41): RESERVED7
    <74d>   DW_AT_decl_file   : 2
    <74e>   DW_AT_decl_line   : 695
    <750>   DW_AT_decl_column : 17
    <751>   DW_AT_type        : <0x3ad>
    <755>   DW_AT_data_member_location: 116
 <2><756>: Abbrev Number: 1 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x9bcc): APB1SMENR1
    <75b>   DW_AT_decl_file   : 2
    <75c>   DW_AT_decl_line   : 696
    <75e>   DW_AT_decl_column : 17
    <75f>   DW_AT_type        : <0x3b9>
    <763>   DW_AT_data_member_location: 120
 <2><764>: Abbrev Number: 1 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0x9bd7): APB1SMENR2
    <769>   DW_AT_decl_file   : 2
    <76a>   DW_AT_decl_line   : 697
    <76c>   DW_AT_decl_column : 17
    <76d>   DW_AT_type        : <0x3b9>
    <771>   DW_AT_data_member_location: 124
 <2><772>: Abbrev Number: 1 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xd02b6): APB2SMENR
    <777>   DW_AT_decl_file   : 2
    <778>   DW_AT_decl_line   : 698
    <77a>   DW_AT_decl_column : 17
    <77b>   DW_AT_type        : <0x3b9>
    <77f>   DW_AT_data_member_location: 128
 <2><780>: Abbrev Number: 1 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0xf2f4b): RESERVED8
    <785>   DW_AT_decl_file   : 2
    <786>   DW_AT_decl_line   : 699
    <788>   DW_AT_decl_column : 17
    <789>   DW_AT_type        : <0x3ad>
    <78d>   DW_AT_data_member_location: 132
 <2><78e>: Abbrev Number: 1 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0x6f3b2): CCIPR
    <793>   DW_AT_decl_file   : 2
    <794>   DW_AT_decl_line   : 700
    <796>   DW_AT_decl_column : 17
    <797>   DW_AT_type        : <0x3b9>
    <79b>   DW_AT_data_member_location: 136
 <2><79c>: Abbrev Number: 1 (DW_TAG_member)
    <79d>   DW_AT_name        : (indirect string, offset: 0xf2f55): RESERVED9
    <7a1>   DW_AT_decl_file   : 2
    <7a2>   DW_AT_decl_line   : 701
    <7a4>   DW_AT_decl_column : 17
    <7a5>   DW_AT_type        : <0x3ad>
    <7a9>   DW_AT_data_member_location: 140
 <2><7aa>: Abbrev Number: 1 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x44cae): BDCR
    <7af>   DW_AT_decl_file   : 2
    <7b0>   DW_AT_decl_line   : 702
    <7b2>   DW_AT_decl_column : 17
    <7b3>   DW_AT_type        : <0x3b9>
    <7b7>   DW_AT_data_member_location: 144
 <2><7b8>: Abbrev Number: 7 (DW_TAG_member)
    <7b9>   DW_AT_name        : CSR
    <7bd>   DW_AT_decl_file   : 2
    <7bd>   DW_AT_decl_line   : 703
    <7bf>   DW_AT_decl_column : 17
    <7c0>   DW_AT_type        : <0x3b9>
    <7c4>   DW_AT_data_member_location: 148
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x47a61): CRRCR
    <7ca>   DW_AT_decl_file   : 2
    <7cb>   DW_AT_decl_line   : 704
    <7cd>   DW_AT_decl_column : 17
    <7ce>   DW_AT_type        : <0x3b9>
    <7d2>   DW_AT_data_member_location: 152
 <2><7d3>: Abbrev Number: 1 (DW_TAG_member)
    <7d4>   DW_AT_name        : (indirect string, offset: 0xe3e84): CCIPR2
    <7d8>   DW_AT_decl_file   : 2
    <7d9>   DW_AT_decl_line   : 705
    <7db>   DW_AT_decl_column : 17
    <7dc>   DW_AT_type        : <0x3b9>
    <7e0>   DW_AT_data_member_location: 156
 <2><7e1>: Abbrev Number: 0
 <1><7e2>: Abbrev Number: 8 (DW_TAG_typedef)
    <7e3>   DW_AT_name        : (indirect string, offset: 0x79bc4): RCC_TypeDef
    <7e7>   DW_AT_decl_file   : 2
    <7e8>   DW_AT_decl_line   : 706
    <7ea>   DW_AT_decl_column : 3
    <7eb>   DW_AT_type        : <0x5ab>
 <1><7ef>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7f0>   DW_AT_byte_size   : 128
    <7f1>   DW_AT_decl_file   : 2
    <7f2>   DW_AT_decl_line   : 1024
    <7f4>   DW_AT_decl_column : 9
    <7f4>   DW_AT_sibling     : <0x8ae>
 <2><7f8>: Abbrev Number: 7 (DW_TAG_member)
    <7f9>   DW_AT_name        : MCR
    <7fd>   DW_AT_decl_file   : 2
    <7fd>   DW_AT_decl_line   : 1026
    <7ff>   DW_AT_decl_column : 17
    <800>   DW_AT_type        : <0x3b9>
    <804>   DW_AT_data_member_location: 0
 <2><805>: Abbrev Number: 1 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xe3b3e): MISR
    <80a>   DW_AT_decl_file   : 2
    <80b>   DW_AT_decl_line   : 1027
    <80d>   DW_AT_decl_column : 17
    <80e>   DW_AT_type        : <0x3b9>
    <812>   DW_AT_data_member_location: 4
 <2><813>: Abbrev Number: 1 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0xda6b3): MICR
    <818>   DW_AT_decl_file   : 2
    <819>   DW_AT_decl_line   : 1028
    <81b>   DW_AT_decl_column : 17
    <81c>   DW_AT_type        : <0x3b9>
    <820>   DW_AT_data_member_location: 8
 <2><821>: Abbrev Number: 1 (DW_TAG_member)
    <822>   DW_AT_name        : (indirect string, offset: 0xae4ac): MDIER
    <826>   DW_AT_decl_file   : 2
    <827>   DW_AT_decl_line   : 1029
    <829>   DW_AT_decl_column : 17
    <82a>   DW_AT_type        : <0x3b9>
    <82e>   DW_AT_data_member_location: 12
 <2><82f>: Abbrev Number: 1 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x360d1): MCNTR
    <834>   DW_AT_decl_file   : 2
    <835>   DW_AT_decl_line   : 1030
    <837>   DW_AT_decl_column : 17
    <838>   DW_AT_type        : <0x3b9>
    <83c>   DW_AT_data_member_location: 16
 <2><83d>: Abbrev Number: 1 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0xf1016): MPER
    <842>   DW_AT_decl_file   : 2
    <843>   DW_AT_decl_line   : 1031
    <845>   DW_AT_decl_column : 17
    <846>   DW_AT_type        : <0x3b9>
    <84a>   DW_AT_data_member_location: 20
 <2><84b>: Abbrev Number: 1 (DW_TAG_member)
    <84c>   DW_AT_name        : (indirect string, offset: 0xfbe54): MREP
    <850>   DW_AT_decl_file   : 2
    <851>   DW_AT_decl_line   : 1032
    <853>   DW_AT_decl_column : 17
    <854>   DW_AT_type        : <0x3b9>
    <858>   DW_AT_data_member_location: 24
 <2><859>: Abbrev Number: 1 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x3a910): MCMP1R
    <85e>   DW_AT_decl_file   : 2
    <85f>   DW_AT_decl_line   : 1033
    <861>   DW_AT_decl_column : 17
    <862>   DW_AT_type        : <0x3b9>
    <866>   DW_AT_data_member_location: 28
 <2><867>: Abbrev Number: 1 (DW_TAG_member)
    <868>   DW_AT_name        : (indirect string, offset: 0xf2ee1): RESERVED0
    <86c>   DW_AT_decl_file   : 2
    <86d>   DW_AT_decl_line   : 1034
    <86f>   DW_AT_decl_column : 17
    <870>   DW_AT_type        : <0x3ad>
    <874>   DW_AT_data_member_location: 32
 <2><875>: Abbrev Number: 1 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0xf2825): MCMP2R
    <87a>   DW_AT_decl_file   : 2
    <87b>   DW_AT_decl_line   : 1035
    <87d>   DW_AT_decl_column : 17
    <87e>   DW_AT_type        : <0x3b9>
    <882>   DW_AT_data_member_location: 36
 <2><883>: Abbrev Number: 1 (DW_TAG_member)
    <884>   DW_AT_name        : (indirect string, offset: 0xc7ac3): MCMP3R
    <888>   DW_AT_decl_file   : 2
    <889>   DW_AT_decl_line   : 1036
    <88b>   DW_AT_decl_column : 17
    <88c>   DW_AT_type        : <0x3b9>
    <890>   DW_AT_data_member_location: 40
 <2><891>: Abbrev Number: 1 (DW_TAG_member)
    <892>   DW_AT_name        : (indirect string, offset: 0x3149): MCMP4R
    <896>   DW_AT_decl_file   : 2
    <897>   DW_AT_decl_line   : 1037
    <899>   DW_AT_decl_column : 17
    <89a>   DW_AT_type        : <0x3b9>
    <89e>   DW_AT_data_member_location: 44
 <2><89f>: Abbrev Number: 1 (DW_TAG_member)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xf2eeb): RESERVED1
    <8a4>   DW_AT_decl_file   : 2
    <8a5>   DW_AT_decl_line   : 1038
    <8a7>   DW_AT_decl_column : 17
    <8a8>   DW_AT_type        : <0x8ae>
    <8ac>   DW_AT_data_member_location: 48
 <2><8ad>: Abbrev Number: 0
 <1><8ae>: Abbrev Number: 16 (DW_TAG_array_type)
    <8af>   DW_AT_type        : <0x3ad>
    <8b3>   DW_AT_sibling     : <0x8be>
 <2><8b7>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <8b8>   DW_AT_type        : <0x382>
    <8bc>   DW_AT_upper_bound : 19
 <2><8bd>: Abbrev Number: 0
 <1><8be>: Abbrev Number: 8 (DW_TAG_typedef)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x22676): HRTIM_Master_TypeDef
    <8c3>   DW_AT_decl_file   : 2
    <8c4>   DW_AT_decl_line   : 1039
    <8c6>   DW_AT_decl_column : 2
    <8c7>   DW_AT_type        : <0x7ef>
 <1><8cb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8cc>   DW_AT_byte_size   : 128
    <8cd>   DW_AT_decl_file   : 2
    <8ce>   DW_AT_decl_line   : 1042
    <8d0>   DW_AT_decl_column : 9
    <8d0>   DW_AT_sibling     : <0xa79>
 <2><8d4>: Abbrev Number: 1 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0xc080b): TIMxCR
    <8d9>   DW_AT_decl_file   : 2
    <8da>   DW_AT_decl_line   : 1044
    <8dc>   DW_AT_decl_column : 17
    <8dd>   DW_AT_type        : <0x3b9>
    <8e1>   DW_AT_data_member_location: 0
 <2><8e2>: Abbrev Number: 1 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x94494): TIMxISR
    <8e7>   DW_AT_decl_file   : 2
    <8e8>   DW_AT_decl_line   : 1045
    <8ea>   DW_AT_decl_column : 17
    <8eb>   DW_AT_type        : <0x3b9>
    <8ef>   DW_AT_data_member_location: 4
 <2><8f0>: Abbrev Number: 1 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x8c8b7): TIMxICR
    <8f5>   DW_AT_decl_file   : 2
    <8f6>   DW_AT_decl_line   : 1046
    <8f8>   DW_AT_decl_column : 17
    <8f9>   DW_AT_type        : <0x3b9>
    <8fd>   DW_AT_data_member_location: 8
 <2><8fe>: Abbrev Number: 1 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x74560): TIMxDIER
    <903>   DW_AT_decl_file   : 2
    <904>   DW_AT_decl_line   : 1047
    <906>   DW_AT_decl_column : 17
    <907>   DW_AT_type        : <0x3b9>
    <90b>   DW_AT_data_member_location: 12
 <2><90c>: Abbrev Number: 1 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0xed693): CNTxR
    <911>   DW_AT_decl_file   : 2
    <912>   DW_AT_decl_line   : 1048
    <914>   DW_AT_decl_column : 17
    <915>   DW_AT_type        : <0x3b9>
    <919>   DW_AT_data_member_location: 16
 <2><91a>: Abbrev Number: 1 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x28d06): PERxR
    <91f>   DW_AT_decl_file   : 2
    <920>   DW_AT_decl_line   : 1049
    <922>   DW_AT_decl_column : 17
    <923>   DW_AT_type        : <0x3b9>
    <927>   DW_AT_data_member_location: 20
 <2><928>: Abbrev Number: 1 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x87cf9): REPxR
    <92d>   DW_AT_decl_file   : 2
    <92e>   DW_AT_decl_line   : 1050
    <930>   DW_AT_decl_column : 17
    <931>   DW_AT_type        : <0x3b9>
    <935>   DW_AT_data_member_location: 24
 <2><936>: Abbrev Number: 1 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x7c250): CMP1xR
    <93b>   DW_AT_decl_file   : 2
    <93c>   DW_AT_decl_line   : 1051
    <93e>   DW_AT_decl_column : 17
    <93f>   DW_AT_type        : <0x3b9>
    <943>   DW_AT_data_member_location: 28
 <2><944>: Abbrev Number: 1 (DW_TAG_member)
    <945>   DW_AT_name        : (indirect string, offset: 0x6718e): CMP1CxR
    <949>   DW_AT_decl_file   : 2
    <94a>   DW_AT_decl_line   : 1052
    <94c>   DW_AT_decl_column : 17
    <94d>   DW_AT_type        : <0x3b9>
    <951>   DW_AT_data_member_location: 32
 <2><952>: Abbrev Number: 1 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0x9fae3): CMP2xR
    <957>   DW_AT_decl_file   : 2
    <958>   DW_AT_decl_line   : 1053
    <95a>   DW_AT_decl_column : 17
    <95b>   DW_AT_type        : <0x3b9>
    <95f>   DW_AT_data_member_location: 36
 <2><960>: Abbrev Number: 1 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0xc1674): CMP3xR
    <965>   DW_AT_decl_file   : 2
    <966>   DW_AT_decl_line   : 1054
    <968>   DW_AT_decl_column : 17
    <969>   DW_AT_type        : <0x3b9>
    <96d>   DW_AT_data_member_location: 40
 <2><96e>: Abbrev Number: 1 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0xe4c8b): CMP4xR
    <973>   DW_AT_decl_file   : 2
    <974>   DW_AT_decl_line   : 1055
    <976>   DW_AT_decl_column : 17
    <977>   DW_AT_type        : <0x3b9>
    <97b>   DW_AT_data_member_location: 44
 <2><97c>: Abbrev Number: 1 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0x69c80): CPT1xR
    <981>   DW_AT_decl_file   : 2
    <982>   DW_AT_decl_line   : 1056
    <984>   DW_AT_decl_column : 17
    <985>   DW_AT_type        : <0x3b9>
    <989>   DW_AT_data_member_location: 48
 <2><98a>: Abbrev Number: 1 (DW_TAG_member)
    <98b>   DW_AT_name        : (indirect string, offset: 0xd63e): CPT2xR
    <98f>   DW_AT_decl_file   : 2
    <990>   DW_AT_decl_line   : 1057
    <992>   DW_AT_decl_column : 17
    <993>   DW_AT_type        : <0x3b9>
    <997>   DW_AT_data_member_location: 52
 <2><998>: Abbrev Number: 1 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0xd0cb1): DTxR
    <99d>   DW_AT_decl_file   : 2
    <99e>   DW_AT_decl_line   : 1058
    <9a0>   DW_AT_decl_column : 17
    <9a1>   DW_AT_type        : <0x3b9>
    <9a5>   DW_AT_data_member_location: 56
 <2><9a6>: Abbrev Number: 1 (DW_TAG_member)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x6b711): SETx1R
    <9ab>   DW_AT_decl_file   : 2
    <9ac>   DW_AT_decl_line   : 1059
    <9ae>   DW_AT_decl_column : 17
    <9af>   DW_AT_type        : <0x3b9>
    <9b3>   DW_AT_data_member_location: 60
 <2><9b4>: Abbrev Number: 1 (DW_TAG_member)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x7dbb6): RSTx1R
    <9b9>   DW_AT_decl_file   : 2
    <9ba>   DW_AT_decl_line   : 1060
    <9bc>   DW_AT_decl_column : 17
    <9bd>   DW_AT_type        : <0x3b9>
    <9c1>   DW_AT_data_member_location: 64
 <2><9c2>: Abbrev Number: 1 (DW_TAG_member)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x6c821): SETx2R
    <9c7>   DW_AT_decl_file   : 2
    <9c8>   DW_AT_decl_line   : 1061
    <9ca>   DW_AT_decl_column : 17
    <9cb>   DW_AT_type        : <0x3b9>
    <9cf>   DW_AT_data_member_location: 68
 <2><9d0>: Abbrev Number: 1 (DW_TAG_member)
    <9d1>   DW_AT_name        : (indirect string, offset: 0x4ce51): RSTx2R
    <9d5>   DW_AT_decl_file   : 2
    <9d6>   DW_AT_decl_line   : 1062
    <9d8>   DW_AT_decl_column : 17
    <9d9>   DW_AT_type        : <0x3b9>
    <9dd>   DW_AT_data_member_location: 72
 <2><9de>: Abbrev Number: 1 (DW_TAG_member)
    <9df>   DW_AT_name        : (indirect string, offset: 0xa4e47): EEFxR1
    <9e3>   DW_AT_decl_file   : 2
    <9e4>   DW_AT_decl_line   : 1063
    <9e6>   DW_AT_decl_column : 17
    <9e7>   DW_AT_type        : <0x3b9>
    <9eb>   DW_AT_data_member_location: 76
 <2><9ec>: Abbrev Number: 1 (DW_TAG_member)
    <9ed>   DW_AT_name        : (indirect string, offset: 0xa4e4e): EEFxR2
    <9f1>   DW_AT_decl_file   : 2
    <9f2>   DW_AT_decl_line   : 1064
    <9f4>   DW_AT_decl_column : 17
    <9f5>   DW_AT_type        : <0x3b9>
    <9f9>   DW_AT_data_member_location: 80
 <2><9fa>: Abbrev Number: 1 (DW_TAG_member)
    <9fb>   DW_AT_name        : (indirect string, offset: 0x1d677): RSTxR
    <9ff>   DW_AT_decl_file   : 2
    <a00>   DW_AT_decl_line   : 1065
    <a02>   DW_AT_decl_column : 17
    <a03>   DW_AT_type        : <0x3b9>
    <a07>   DW_AT_data_member_location: 84
 <2><a08>: Abbrev Number: 1 (DW_TAG_member)
    <a09>   DW_AT_name        : (indirect string, offset: 0x46609): CHPxR
    <a0d>   DW_AT_decl_file   : 2
    <a0e>   DW_AT_decl_line   : 1066
    <a10>   DW_AT_decl_column : 17
    <a11>   DW_AT_type        : <0x3b9>
    <a15>   DW_AT_data_member_location: 88
 <2><a16>: Abbrev Number: 1 (DW_TAG_member)
    <a17>   DW_AT_name        : (indirect string, offset: 0x2742b): CPT1xCR
    <a1b>   DW_AT_decl_file   : 2
    <a1c>   DW_AT_decl_line   : 1067
    <a1e>   DW_AT_decl_column : 17
    <a1f>   DW_AT_type        : <0x3b9>
    <a23>   DW_AT_data_member_location: 92
 <2><a24>: Abbrev Number: 1 (DW_TAG_member)
    <a25>   DW_AT_name        : (indirect string, offset: 0x55909): CPT2xCR
    <a29>   DW_AT_decl_file   : 2
    <a2a>   DW_AT_decl_line   : 1068
    <a2c>   DW_AT_decl_column : 17
    <a2d>   DW_AT_type        : <0x3b9>
    <a31>   DW_AT_data_member_location: 96
 <2><a32>: Abbrev Number: 1 (DW_TAG_member)
    <a33>   DW_AT_name        : (indirect string, offset: 0xc492): OUTxR
    <a37>   DW_AT_decl_file   : 2
    <a38>   DW_AT_decl_line   : 1069
    <a3a>   DW_AT_decl_column : 17
    <a3b>   DW_AT_type        : <0x3b9>
    <a3f>   DW_AT_data_member_location: 100
 <2><a40>: Abbrev Number: 1 (DW_TAG_member)
    <a41>   DW_AT_name        : (indirect string, offset: 0x8618d): FLTxR
    <a45>   DW_AT_decl_file   : 2
    <a46>   DW_AT_decl_line   : 1070
    <a48>   DW_AT_decl_column : 17
    <a49>   DW_AT_type        : <0x3b9>
    <a4d>   DW_AT_data_member_location: 104
 <2><a4e>: Abbrev Number: 1 (DW_TAG_member)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x4bea3): TIMxCR2
    <a53>   DW_AT_decl_file   : 2
    <a54>   DW_AT_decl_line   : 1071
    <a56>   DW_AT_decl_column : 17
    <a57>   DW_AT_type        : <0x3b9>
    <a5b>   DW_AT_data_member_location: 108
 <2><a5c>: Abbrev Number: 1 (DW_TAG_member)
    <a5d>   DW_AT_name        : (indirect string, offset: 0xf4162): EEFxR3
    <a61>   DW_AT_decl_file   : 2
    <a62>   DW_AT_decl_line   : 1072
    <a64>   DW_AT_decl_column : 17
    <a65>   DW_AT_type        : <0x3b9>
    <a69>   DW_AT_data_member_location: 112
 <2><a6a>: Abbrev Number: 1 (DW_TAG_member)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xf2ee1): RESERVED0
    <a6f>   DW_AT_decl_file   : 2
    <a70>   DW_AT_decl_line   : 1073
    <a72>   DW_AT_decl_column : 14
    <a73>   DW_AT_type        : <0xa79>
    <a77>   DW_AT_data_member_location: 116
 <2><a78>: Abbrev Number: 0
 <1><a79>: Abbrev Number: 16 (DW_TAG_array_type)
    <a7a>   DW_AT_type        : <0x3ad>
    <a7e>   DW_AT_sibling     : <0xa89>
 <2><a82>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a83>   DW_AT_type        : <0x382>
    <a87>   DW_AT_upper_bound : 2
 <2><a88>: Abbrev Number: 0
 <1><a89>: Abbrev Number: 8 (DW_TAG_typedef)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x22f84): HRTIM_Timerx_TypeDef
    <a8e>   DW_AT_decl_file   : 2
    <a8f>   DW_AT_decl_line   : 1074
    <a91>   DW_AT_decl_column : 2
    <a92>   DW_AT_type        : <0x8cb>
 <1><a96>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a97>   DW_AT_byte_size   : 144
    <a98>   DW_AT_decl_file   : 2
    <a99>   DW_AT_decl_line   : 1077
    <a9b>   DW_AT_decl_column : 9
    <a9b>   DW_AT_sibling     : <0xc93>
 <2><a9f>: Abbrev Number: 7 (DW_TAG_member)
    <aa0>   DW_AT_name        : CR1
    <aa4>   DW_AT_decl_file   : 2
    <aa4>   DW_AT_decl_line   : 1079
    <aa6>   DW_AT_decl_column : 17
    <aa7>   DW_AT_type        : <0x3b9>
    <aab>   DW_AT_data_member_location: 0
 <2><aac>: Abbrev Number: 7 (DW_TAG_member)
    <aad>   DW_AT_name        : CR2
    <ab1>   DW_AT_decl_file   : 2
    <ab1>   DW_AT_decl_line   : 1080
    <ab3>   DW_AT_decl_column : 17
    <ab4>   DW_AT_type        : <0x3b9>
    <ab8>   DW_AT_data_member_location: 4
 <2><ab9>: Abbrev Number: 7 (DW_TAG_member)
    <aba>   DW_AT_name        : ISR
    <abe>   DW_AT_decl_file   : 2
    <abe>   DW_AT_decl_line   : 1081
    <ac0>   DW_AT_decl_column : 17
    <ac1>   DW_AT_type        : <0x3b9>
    <ac5>   DW_AT_data_member_location: 8
 <2><ac6>: Abbrev Number: 7 (DW_TAG_member)
    <ac7>   DW_AT_name        : ICR
    <acb>   DW_AT_decl_file   : 2
    <acb>   DW_AT_decl_line   : 1082
    <acd>   DW_AT_decl_column : 17
    <ace>   DW_AT_type        : <0x3b9>
    <ad2>   DW_AT_data_member_location: 12
 <2><ad3>: Abbrev Number: 7 (DW_TAG_member)
    <ad4>   DW_AT_name        : IER
    <ad8>   DW_AT_decl_file   : 2
    <ad8>   DW_AT_decl_line   : 1083
    <ada>   DW_AT_decl_column : 17
    <adb>   DW_AT_type        : <0x3b9>
    <adf>   DW_AT_data_member_location: 16
 <2><ae0>: Abbrev Number: 1 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0xb34cc): OENR
    <ae5>   DW_AT_decl_file   : 2
    <ae6>   DW_AT_decl_line   : 1084
    <ae8>   DW_AT_decl_column : 17
    <ae9>   DW_AT_type        : <0x3b9>
    <aed>   DW_AT_data_member_location: 20
 <2><aee>: Abbrev Number: 1 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x578f6): ODISR
    <af3>   DW_AT_decl_file   : 2
    <af4>   DW_AT_decl_line   : 1085
    <af6>   DW_AT_decl_column : 17
    <af7>   DW_AT_type        : <0x3b9>
    <afb>   DW_AT_data_member_location: 24
 <2><afc>: Abbrev Number: 1 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0x1f0a8): ODSR
    <b01>   DW_AT_decl_file   : 2
    <b02>   DW_AT_decl_line   : 1086
    <b04>   DW_AT_decl_column : 17
    <b05>   DW_AT_type        : <0x3b9>
    <b09>   DW_AT_data_member_location: 28
 <2><b0a>: Abbrev Number: 1 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x615b8): BMCR
    <b0f>   DW_AT_decl_file   : 2
    <b10>   DW_AT_decl_line   : 1087
    <b12>   DW_AT_decl_column : 17
    <b13>   DW_AT_type        : <0x3b9>
    <b17>   DW_AT_data_member_location: 32
 <2><b18>: Abbrev Number: 1 (DW_TAG_member)
    <b19>   DW_AT_name        : (indirect string, offset: 0x30767): BMTRGR
    <b1d>   DW_AT_decl_file   : 2
    <b1e>   DW_AT_decl_line   : 1088
    <b20>   DW_AT_decl_column : 17
    <b21>   DW_AT_type        : <0x3b9>
    <b25>   DW_AT_data_member_location: 36
 <2><b26>: Abbrev Number: 1 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0x6528b): BMCMPR
    <b2b>   DW_AT_decl_file   : 2
    <b2c>   DW_AT_decl_line   : 1089
    <b2e>   DW_AT_decl_column : 17
    <b2f>   DW_AT_type        : <0x3b9>
    <b33>   DW_AT_data_member_location: 40
 <2><b34>: Abbrev Number: 1 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0x9b0f2): BMPER
    <b39>   DW_AT_decl_file   : 2
    <b3a>   DW_AT_decl_line   : 1090
    <b3c>   DW_AT_decl_column : 17
    <b3d>   DW_AT_type        : <0x3b9>
    <b41>   DW_AT_data_member_location: 44
 <2><b42>: Abbrev Number: 1 (DW_TAG_member)
    <b43>   DW_AT_name        : (indirect string, offset: 0x81bba): EECR1
    <b47>   DW_AT_decl_file   : 2
    <b48>   DW_AT_decl_line   : 1091
    <b4a>   DW_AT_decl_column : 17
    <b4b>   DW_AT_type        : <0x3b9>
    <b4f>   DW_AT_data_member_location: 48
 <2><b50>: Abbrev Number: 1 (DW_TAG_member)
    <b51>   DW_AT_name        : (indirect string, offset: 0x81bc0): EECR2
    <b55>   DW_AT_decl_file   : 2
    <b56>   DW_AT_decl_line   : 1092
    <b58>   DW_AT_decl_column : 17
    <b59>   DW_AT_type        : <0x3b9>
    <b5d>   DW_AT_data_member_location: 52
 <2><b5e>: Abbrev Number: 1 (DW_TAG_member)
    <b5f>   DW_AT_name        : (indirect string, offset: 0x27268): EECR3
    <b63>   DW_AT_decl_file   : 2
    <b64>   DW_AT_decl_line   : 1093
    <b66>   DW_AT_decl_column : 17
    <b67>   DW_AT_type        : <0x3b9>
    <b6b>   DW_AT_data_member_location: 56
 <2><b6c>: Abbrev Number: 1 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0xf8751): ADC1R
    <b71>   DW_AT_decl_file   : 2
    <b72>   DW_AT_decl_line   : 1094
    <b74>   DW_AT_decl_column : 17
    <b75>   DW_AT_type        : <0x3b9>
    <b79>   DW_AT_data_member_location: 60
 <2><b7a>: Abbrev Number: 1 (DW_TAG_member)
    <b7b>   DW_AT_name        : (indirect string, offset: 0xf9057): ADC2R
    <b7f>   DW_AT_decl_file   : 2
    <b80>   DW_AT_decl_line   : 1095
    <b82>   DW_AT_decl_column : 17
    <b83>   DW_AT_type        : <0x3b9>
    <b87>   DW_AT_data_member_location: 64
 <2><b88>: Abbrev Number: 1 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0xf98a5): ADC3R
    <b8d>   DW_AT_decl_file   : 2
    <b8e>   DW_AT_decl_line   : 1096
    <b90>   DW_AT_decl_column : 17
    <b91>   DW_AT_type        : <0x3b9>
    <b95>   DW_AT_data_member_location: 68
 <2><b96>: Abbrev Number: 1 (DW_TAG_member)
    <b97>   DW_AT_name        : (indirect string, offset: 0x20a88): ADC4R
    <b9b>   DW_AT_decl_file   : 2
    <b9c>   DW_AT_decl_line   : 1097
    <b9e>   DW_AT_decl_column : 17
    <b9f>   DW_AT_type        : <0x3b9>
    <ba3>   DW_AT_data_member_location: 72
 <2><ba4>: Abbrev Number: 1 (DW_TAG_member)
    <ba5>   DW_AT_name        : (indirect string, offset: 0xaceda): DLLCR
    <ba9>   DW_AT_decl_file   : 2
    <baa>   DW_AT_decl_line   : 1098
    <bac>   DW_AT_decl_column : 17
    <bad>   DW_AT_type        : <0x3b9>
    <bb1>   DW_AT_data_member_location: 76
 <2><bb2>: Abbrev Number: 1 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x546bb): FLTINR1
    <bb7>   DW_AT_decl_file   : 2
    <bb8>   DW_AT_decl_line   : 1099
    <bba>   DW_AT_decl_column : 17
    <bbb>   DW_AT_type        : <0x3b9>
    <bbf>   DW_AT_data_member_location: 80
 <2><bc0>: Abbrev Number: 1 (DW_TAG_member)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x546c3): FLTINR2
    <bc5>   DW_AT_decl_file   : 2
    <bc6>   DW_AT_decl_line   : 1100
    <bc8>   DW_AT_decl_column : 17
    <bc9>   DW_AT_type        : <0x3b9>
    <bcd>   DW_AT_data_member_location: 84
 <2><bce>: Abbrev Number: 1 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x84fff): BDMUPR
    <bd3>   DW_AT_decl_file   : 2
    <bd4>   DW_AT_decl_line   : 1101
    <bd6>   DW_AT_decl_column : 17
    <bd7>   DW_AT_type        : <0x3b9>
    <bdb>   DW_AT_data_member_location: 88
 <2><bdc>: Abbrev Number: 1 (DW_TAG_member)
    <bdd>   DW_AT_name        : (indirect string, offset: 0xa6260): BDTAUPR
    <be1>   DW_AT_decl_file   : 2
    <be2>   DW_AT_decl_line   : 1102
    <be4>   DW_AT_decl_column : 17
    <be5>   DW_AT_type        : <0x3b9>
    <be9>   DW_AT_data_member_location: 92
 <2><bea>: Abbrev Number: 1 (DW_TAG_member)
    <beb>   DW_AT_name        : (indirect string, offset: 0xd3ed1): BDTBUPR
    <bef>   DW_AT_decl_file   : 2
    <bf0>   DW_AT_decl_line   : 1103
    <bf2>   DW_AT_decl_column : 17
    <bf3>   DW_AT_type        : <0x3b9>
    <bf7>   DW_AT_data_member_location: 96
 <2><bf8>: Abbrev Number: 1 (DW_TAG_member)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x1446): BDTCUPR
    <bfd>   DW_AT_decl_file   : 2
    <bfe>   DW_AT_decl_line   : 1104
    <c00>   DW_AT_decl_column : 17
    <c01>   DW_AT_type        : <0x3b9>
    <c05>   DW_AT_data_member_location: 100
 <2><c06>: Abbrev Number: 1 (DW_TAG_member)
    <c07>   DW_AT_name        : (indirect string, offset: 0x33232): BDTDUPR
    <c0b>   DW_AT_decl_file   : 2
    <c0c>   DW_AT_decl_line   : 1105
    <c0e>   DW_AT_decl_column : 17
    <c0f>   DW_AT_type        : <0x3b9>
    <c13>   DW_AT_data_member_location: 104
 <2><c14>: Abbrev Number: 1 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0x61847): BDTEUPR
    <c19>   DW_AT_decl_file   : 2
    <c1a>   DW_AT_decl_line   : 1106
    <c1c>   DW_AT_decl_column : 17
    <c1d>   DW_AT_type        : <0x3b9>
    <c21>   DW_AT_data_member_location: 108
 <2><c22>: Abbrev Number: 1 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0xaf30d): BDMADR
    <c27>   DW_AT_decl_file   : 2
    <c28>   DW_AT_decl_line   : 1107
    <c2a>   DW_AT_decl_column : 17
    <c2b>   DW_AT_type        : <0x3b9>
    <c2f>   DW_AT_data_member_location: 112
 <2><c30>: Abbrev Number: 1 (DW_TAG_member)
    <c31>   DW_AT_name        : (indirect string, offset: 0x9117d): BDTFUPR
    <c35>   DW_AT_decl_file   : 2
    <c36>   DW_AT_decl_line   : 1108
    <c38>   DW_AT_decl_column : 17
    <c39>   DW_AT_type        : <0x3b9>
    <c3d>   DW_AT_data_member_location: 116
 <2><c3e>: Abbrev Number: 1 (DW_TAG_member)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x1163): ADCER
    <c43>   DW_AT_decl_file   : 2
    <c44>   DW_AT_decl_line   : 1109
    <c46>   DW_AT_decl_column : 17
    <c47>   DW_AT_type        : <0x3b9>
    <c4b>   DW_AT_data_member_location: 120
 <2><c4c>: Abbrev Number: 1 (DW_TAG_member)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x9946): ADCUR
    <c51>   DW_AT_decl_file   : 2
    <c52>   DW_AT_decl_line   : 1110
    <c54>   DW_AT_decl_column : 17
    <c55>   DW_AT_type        : <0x3b9>
    <c59>   DW_AT_data_member_location: 124
 <2><c5a>: Abbrev Number: 1 (DW_TAG_member)
    <c5b>   DW_AT_name        : (indirect string, offset: 0xb4f90): ADCPS1
    <c5f>   DW_AT_decl_file   : 2
    <c60>   DW_AT_decl_line   : 1111
    <c62>   DW_AT_decl_column : 17
    <c63>   DW_AT_type        : <0x3b9>
    <c67>   DW_AT_data_member_location: 128
 <2><c68>: Abbrev Number: 1 (DW_TAG_member)
    <c69>   DW_AT_name        : (indirect string, offset: 0x86327): ADCPS2
    <c6d>   DW_AT_decl_file   : 2
    <c6e>   DW_AT_decl_line   : 1112
    <c70>   DW_AT_decl_column : 17
    <c71>   DW_AT_type        : <0x3b9>
    <c75>   DW_AT_data_member_location: 132
 <2><c76>: Abbrev Number: 1 (DW_TAG_member)
    <c77>   DW_AT_name        : (indirect string, offset: 0x546cb): FLTINR3
    <c7b>   DW_AT_decl_file   : 2
    <c7c>   DW_AT_decl_line   : 1113
    <c7e>   DW_AT_decl_column : 17
    <c7f>   DW_AT_type        : <0x3b9>
    <c83>   DW_AT_data_member_location: 136
 <2><c84>: Abbrev Number: 1 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0x59672): FLTINR4
    <c89>   DW_AT_decl_file   : 2
    <c8a>   DW_AT_decl_line   : 1114
    <c8c>   DW_AT_decl_column : 17
    <c8d>   DW_AT_type        : <0x3b9>
    <c91>   DW_AT_data_member_location: 140
 <2><c92>: Abbrev Number: 0
 <1><c93>: Abbrev Number: 8 (DW_TAG_typedef)
    <c94>   DW_AT_name        : (indirect string, offset: 0x4b948): HRTIM_Common_TypeDef
    <c98>   DW_AT_decl_file   : 2
    <c99>   DW_AT_decl_line   : 1115
    <c9b>   DW_AT_decl_column : 2
    <c9c>   DW_AT_type        : <0xa96>
 <1><ca0>: Abbrev Number: 27 (DW_TAG_structure_type)
    <ca1>   DW_AT_byte_size   : 1040
    <ca3>   DW_AT_decl_file   : 2
    <ca4>   DW_AT_decl_line   : 1118
    <ca6>   DW_AT_decl_column : 9
    <ca7>   DW_AT_sibling     : <0xcd7>
 <2><cab>: Abbrev Number: 1 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0x3f35c): sMasterRegs
    <cb0>   DW_AT_decl_file   : 2
    <cb1>   DW_AT_decl_line   : 1119
    <cb3>   DW_AT_decl_column : 24
    <cb4>   DW_AT_type        : <0x8be>
    <cb8>   DW_AT_data_member_location: 0
 <2><cb9>: Abbrev Number: 1 (DW_TAG_member)
    <cba>   DW_AT_name        : (indirect string, offset: 0xc2531): sTimerxRegs
    <cbe>   DW_AT_decl_file   : 2
    <cbf>   DW_AT_decl_line   : 1120
    <cc1>   DW_AT_decl_column : 24
    <cc2>   DW_AT_type        : <0xcd7>
    <cc6>   DW_AT_data_member_location: 128
 <2><cc7>: Abbrev Number: 28 (DW_TAG_member)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x8aeaf): sCommonRegs
    <ccc>   DW_AT_decl_file   : 2
    <ccd>   DW_AT_decl_line   : 1121
    <ccf>   DW_AT_decl_column : 24
    <cd0>   DW_AT_type        : <0xc93>
    <cd4>   DW_AT_data_member_location: 896
 <2><cd6>: Abbrev Number: 0
 <1><cd7>: Abbrev Number: 16 (DW_TAG_array_type)
    <cd8>   DW_AT_type        : <0xa89>
    <cdc>   DW_AT_sibling     : <0xce7>
 <2><ce0>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ce1>   DW_AT_type        : <0x382>
    <ce5>   DW_AT_upper_bound : 5
 <2><ce6>: Abbrev Number: 0
 <1><ce7>: Abbrev Number: 8 (DW_TAG_typedef)
    <ce8>   DW_AT_name        : (indirect string, offset: 0x21f26): HRTIM_TypeDef
    <cec>   DW_AT_decl_file   : 2
    <ced>   DW_AT_decl_line   : 1122
    <cef>   DW_AT_decl_column : 2
    <cf0>   DW_AT_type        : <0xca0>
 <1><cf4>: Abbrev Number: 11 (DW_TAG_base_type)
    <cf5>   DW_AT_byte_size   : 8
    <cf6>   DW_AT_encoding    : 4	(float)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x2a397): long double
 <1><cfb>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <cfc>   DW_AT_encoding    : 7	(unsigned)
    <cfd>   DW_AT_byte_size   : 1
    <cfd>   DW_AT_type        : <0x31a>
    <d01>   DW_AT_decl_file   : 5
    <d02>   DW_AT_decl_line   : 39
    <d03>   DW_AT_decl_column : 1
    <d03>   DW_AT_sibling     : <0xd20>
 <2><d07>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d08>   DW_AT_name        : (indirect string, offset: 0x57437): HAL_OK
    <d0c>   DW_AT_const_value : 0
 <2><d0d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d0e>   DW_AT_name        : (indirect string, offset: 0xa3122): HAL_ERROR
    <d12>   DW_AT_const_value : 1
 <2><d13>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d14>   DW_AT_name        : (indirect string, offset: 0x2f661): HAL_BUSY
    <d18>   DW_AT_const_value : 2
 <2><d19>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x4d287): HAL_TIMEOUT
    <d1e>   DW_AT_const_value : 3
 <2><d1f>: Abbrev Number: 0
 <1><d20>: Abbrev Number: 5 (DW_TAG_typedef)
    <d21>   DW_AT_name        : (indirect string, offset: 0x2af2): HAL_StatusTypeDef
    <d25>   DW_AT_decl_file   : 5
    <d26>   DW_AT_decl_line   : 44
    <d27>   DW_AT_decl_column : 3
    <d28>   DW_AT_type        : <0xcfb>
 <1><d2c>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <d2d>   DW_AT_encoding    : 7	(unsigned)
    <d2e>   DW_AT_byte_size   : 1
    <d2e>   DW_AT_type        : <0x31a>
    <d32>   DW_AT_decl_file   : 5
    <d33>   DW_AT_decl_line   : 50
    <d34>   DW_AT_decl_column : 1
    <d34>   DW_AT_sibling     : <0xd45>
 <2><d38>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d39>   DW_AT_name        : (indirect string, offset: 0xbf58e): HAL_UNLOCKED
    <d3d>   DW_AT_const_value : 0
 <2><d3e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d3f>   DW_AT_name        : (indirect string, offset: 0x100c1c): HAL_LOCKED
    <d43>   DW_AT_const_value : 1
 <2><d44>: Abbrev Number: 0
 <1><d45>: Abbrev Number: 5 (DW_TAG_typedef)
    <d46>   DW_AT_name        : (indirect string, offset: 0x9f7a4): HAL_LockTypeDef
    <d4a>   DW_AT_decl_file   : 5
    <d4b>   DW_AT_decl_line   : 53
    <d4c>   DW_AT_decl_column : 3
    <d4d>   DW_AT_type        : <0xd2c>
 <1><d51>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d52>   DW_AT_byte_size   : 28
    <d53>   DW_AT_decl_file   : 6
    <d54>   DW_AT_decl_line   : 45
    <d55>   DW_AT_decl_column : 9
    <d55>   DW_AT_sibling     : <0xdb5>
 <2><d59>: Abbrev Number: 3 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0xaea8b): PLLState
    <d5e>   DW_AT_decl_file   : 6
    <d5f>   DW_AT_decl_line   : 47
    <d60>   DW_AT_decl_column : 12
    <d61>   DW_AT_type        : <0x3ad>
    <d65>   DW_AT_data_member_location: 0
 <2><d66>: Abbrev Number: 3 (DW_TAG_member)
    <d67>   DW_AT_name        : (indirect string, offset: 0x104929): PLLSource
    <d6b>   DW_AT_decl_file   : 6
    <d6c>   DW_AT_decl_line   : 50
    <d6d>   DW_AT_decl_column : 12
    <d6e>   DW_AT_type        : <0x3ad>
    <d72>   DW_AT_data_member_location: 4
 <2><d73>: Abbrev Number: 3 (DW_TAG_member)
    <d74>   DW_AT_name        : (indirect string, offset: 0xa878d): PLLM
    <d78>   DW_AT_decl_file   : 6
    <d79>   DW_AT_decl_line   : 53
    <d7a>   DW_AT_decl_column : 12
    <d7b>   DW_AT_type        : <0x3ad>
    <d7f>   DW_AT_data_member_location: 8
 <2><d80>: Abbrev Number: 3 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0xa8792): PLLN
    <d85>   DW_AT_decl_file   : 6
    <d86>   DW_AT_decl_line   : 56
    <d87>   DW_AT_decl_column : 12
    <d88>   DW_AT_type        : <0x3ad>
    <d8c>   DW_AT_data_member_location: 12
 <2><d8d>: Abbrev Number: 3 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0xd56bb): PLLP
    <d92>   DW_AT_decl_file   : 6
    <d93>   DW_AT_decl_line   : 59
    <d94>   DW_AT_decl_column : 12
    <d95>   DW_AT_type        : <0x3ad>
    <d99>   DW_AT_data_member_location: 16
 <2><d9a>: Abbrev Number: 3 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xbc55d): PLLQ
    <d9f>   DW_AT_decl_file   : 6
    <da0>   DW_AT_decl_line   : 62
    <da1>   DW_AT_decl_column : 12
    <da2>   DW_AT_type        : <0x3ad>
    <da6>   DW_AT_data_member_location: 20
 <2><da7>: Abbrev Number: 3 (DW_TAG_member)
    <da8>   DW_AT_name        : (indirect string, offset: 0xd56c0): PLLR
    <dac>   DW_AT_decl_file   : 6
    <dad>   DW_AT_decl_line   : 65
    <dae>   DW_AT_decl_column : 12
    <daf>   DW_AT_type        : <0x3ad>
    <db3>   DW_AT_data_member_location: 24
 <2><db4>: Abbrev Number: 0
 <1><db5>: Abbrev Number: 5 (DW_TAG_typedef)
    <db6>   DW_AT_name        : (indirect string, offset: 0xfc42b): RCC_PLLInitTypeDef
    <dba>   DW_AT_decl_file   : 6
    <dbb>   DW_AT_decl_line   : 69
    <dbc>   DW_AT_decl_column : 2
    <dbd>   DW_AT_type        : <0xd51>
 <1><dc1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <dc2>   DW_AT_byte_size   : 56
    <dc3>   DW_AT_decl_file   : 6
    <dc4>   DW_AT_decl_line   : 74
    <dc5>   DW_AT_decl_column : 9
    <dc5>   DW_AT_sibling     : <0xe32>
 <2><dc9>: Abbrev Number: 3 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0xf85d): OscillatorType
    <dce>   DW_AT_decl_file   : 6
    <dcf>   DW_AT_decl_line   : 76
    <dd0>   DW_AT_decl_column : 12
    <dd1>   DW_AT_type        : <0x3ad>
    <dd5>   DW_AT_data_member_location: 0
 <2><dd6>: Abbrev Number: 3 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0xb0897): HSEState
    <ddb>   DW_AT_decl_file   : 6
    <ddc>   DW_AT_decl_line   : 79
    <ddd>   DW_AT_decl_column : 12
    <dde>   DW_AT_type        : <0x3ad>
    <de2>   DW_AT_data_member_location: 4
 <2><de3>: Abbrev Number: 3 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0xa3cf4): LSEState
    <de8>   DW_AT_decl_file   : 6
    <de9>   DW_AT_decl_line   : 82
    <dea>   DW_AT_decl_column : 12
    <deb>   DW_AT_type        : <0x3ad>
    <def>   DW_AT_data_member_location: 8
 <2><df0>: Abbrev Number: 3 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0x74bbe): HSIState
    <df5>   DW_AT_decl_file   : 6
    <df6>   DW_AT_decl_line   : 85
    <df7>   DW_AT_decl_column : 12
    <df8>   DW_AT_type        : <0x3ad>
    <dfc>   DW_AT_data_member_location: 12
 <2><dfd>: Abbrev Number: 3 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0xdd964): HSICalibrationValue
    <e02>   DW_AT_decl_file   : 6
    <e03>   DW_AT_decl_line   : 88
    <e04>   DW_AT_decl_column : 12
    <e05>   DW_AT_type        : <0x3ad>
    <e09>   DW_AT_data_member_location: 16
 <2><e0a>: Abbrev Number: 3 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x5a9cb): LSIState
    <e0f>   DW_AT_decl_file   : 6
    <e10>   DW_AT_decl_line   : 91
    <e11>   DW_AT_decl_column : 12
    <e12>   DW_AT_type        : <0x3ad>
    <e16>   DW_AT_data_member_location: 20
 <2><e17>: Abbrev Number: 3 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0xb8512): HSI48State
    <e1c>   DW_AT_decl_file   : 6
    <e1d>   DW_AT_decl_line   : 94
    <e1e>   DW_AT_decl_column : 12
    <e1f>   DW_AT_type        : <0x3ad>
    <e23>   DW_AT_data_member_location: 24
 <2><e24>: Abbrev Number: 24 (DW_TAG_member)
    <e25>   DW_AT_name        : PLL
    <e29>   DW_AT_decl_file   : 6
    <e2a>   DW_AT_decl_line   : 97
    <e2b>   DW_AT_decl_column : 22
    <e2c>   DW_AT_type        : <0xdb5>
    <e30>   DW_AT_data_member_location: 28
 <2><e31>: Abbrev Number: 0
 <1><e32>: Abbrev Number: 5 (DW_TAG_typedef)
    <e33>   DW_AT_name        : (indirect string, offset: 0xae9b2): RCC_OscInitTypeDef
    <e37>   DW_AT_decl_file   : 6
    <e38>   DW_AT_decl_line   : 99
    <e39>   DW_AT_decl_column : 2
    <e3a>   DW_AT_type        : <0xdc1>
 <1><e3e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e3f>   DW_AT_byte_size   : 20
    <e40>   DW_AT_decl_file   : 6
    <e41>   DW_AT_decl_line   : 104
    <e42>   DW_AT_decl_column : 9
    <e42>   DW_AT_sibling     : <0xe88>
 <2><e46>: Abbrev Number: 3 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0x4ff1d): ClockType
    <e4b>   DW_AT_decl_file   : 6
    <e4c>   DW_AT_decl_line   : 106
    <e4d>   DW_AT_decl_column : 12
    <e4e>   DW_AT_type        : <0x3ad>
    <e52>   DW_AT_data_member_location: 0
 <2><e53>: Abbrev Number: 3 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0x85c47): SYSCLKSource
    <e58>   DW_AT_decl_file   : 6
    <e59>   DW_AT_decl_line   : 109
    <e5a>   DW_AT_decl_column : 12
    <e5b>   DW_AT_type        : <0x3ad>
    <e5f>   DW_AT_data_member_location: 4
 <2><e60>: Abbrev Number: 3 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0xd4efe): AHBCLKDivider
    <e65>   DW_AT_decl_file   : 6
    <e66>   DW_AT_decl_line   : 112
    <e67>   DW_AT_decl_column : 12
    <e68>   DW_AT_type        : <0x3ad>
    <e6c>   DW_AT_data_member_location: 8
 <2><e6d>: Abbrev Number: 3 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x9ed4): APB1CLKDivider
    <e72>   DW_AT_decl_file   : 6
    <e73>   DW_AT_decl_line   : 115
    <e74>   DW_AT_decl_column : 12
    <e75>   DW_AT_type        : <0x3ad>
    <e79>   DW_AT_data_member_location: 12
 <2><e7a>: Abbrev Number: 3 (DW_TAG_member)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x77cf3): APB2CLKDivider
    <e7f>   DW_AT_decl_file   : 6
    <e80>   DW_AT_decl_line   : 118
    <e81>   DW_AT_decl_column : 12
    <e82>   DW_AT_type        : <0x3ad>
    <e86>   DW_AT_data_member_location: 16
 <2><e87>: Abbrev Number: 0
 <1><e88>: Abbrev Number: 5 (DW_TAG_typedef)
    <e89>   DW_AT_name        : (indirect string, offset: 0x4ff86): RCC_ClkInitTypeDef
    <e8d>   DW_AT_decl_file   : 6
    <e8e>   DW_AT_decl_line   : 121
    <e8f>   DW_AT_decl_column : 2
    <e90>   DW_AT_type        : <0xe3e>
 <1><e94>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e95>   DW_AT_byte_size   : 20
    <e96>   DW_AT_decl_file   : 7
    <e97>   DW_AT_decl_line   : 47
    <e98>   DW_AT_decl_column : 9
    <e98>   DW_AT_sibling     : <0xede>
 <2><e9c>: Abbrev Number: 24 (DW_TAG_member)
    <e9d>   DW_AT_name        : Pin
    <ea1>   DW_AT_decl_file   : 7
    <ea2>   DW_AT_decl_line   : 49
    <ea3>   DW_AT_decl_column : 12
    <ea4>   DW_AT_type        : <0x3ad>
    <ea8>   DW_AT_data_member_location: 0
 <2><ea9>: Abbrev Number: 3 (DW_TAG_member)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x1047c0): Mode
    <eae>   DW_AT_decl_file   : 7
    <eaf>   DW_AT_decl_line   : 52
    <eb0>   DW_AT_decl_column : 12
    <eb1>   DW_AT_type        : <0x3ad>
    <eb5>   DW_AT_data_member_location: 4
 <2><eb6>: Abbrev Number: 3 (DW_TAG_member)
    <eb7>   DW_AT_name        : (indirect string, offset: 0xb4c54): Pull
    <ebb>   DW_AT_decl_file   : 7
    <ebc>   DW_AT_decl_line   : 55
    <ebd>   DW_AT_decl_column : 12
    <ebe>   DW_AT_type        : <0x3ad>
    <ec2>   DW_AT_data_member_location: 8
 <2><ec3>: Abbrev Number: 3 (DW_TAG_member)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x98b2c): Speed
    <ec8>   DW_AT_decl_file   : 7
    <ec9>   DW_AT_decl_line   : 58
    <eca>   DW_AT_decl_column : 12
    <ecb>   DW_AT_type        : <0x3ad>
    <ecf>   DW_AT_data_member_location: 12
 <2><ed0>: Abbrev Number: 3 (DW_TAG_member)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x77cba): Alternate
    <ed5>   DW_AT_decl_file   : 7
    <ed6>   DW_AT_decl_line   : 61
    <ed7>   DW_AT_decl_column : 12
    <ed8>   DW_AT_type        : <0x3ad>
    <edc>   DW_AT_data_member_location: 16
 <2><edd>: Abbrev Number: 0
 <1><ede>: Abbrev Number: 5 (DW_TAG_typedef)
    <edf>   DW_AT_name        : (indirect string, offset: 0xc9c82): GPIO_InitTypeDef
    <ee3>   DW_AT_decl_file   : 7
    <ee4>   DW_AT_decl_line   : 63
    <ee5>   DW_AT_decl_column : 3
    <ee6>   DW_AT_type        : <0xe94>
 <1><eea>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <eeb>   DW_AT_encoding    : 7	(unsigned)
    <eec>   DW_AT_byte_size   : 1
    <eec>   DW_AT_type        : <0x31a>
    <ef0>   DW_AT_decl_file   : 7
    <ef1>   DW_AT_decl_line   : 69
    <ef2>   DW_AT_decl_column : 1
    <ef2>   DW_AT_sibling     : <0xf03>
 <2><ef6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x373b8): GPIO_PIN_RESET
    <efb>   DW_AT_const_value : 0
 <2><efc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <efd>   DW_AT_name        : (indirect string, offset: 0x426df): GPIO_PIN_SET
    <f01>   DW_AT_const_value : 1
 <2><f02>: Abbrev Number: 0
 <1><f03>: Abbrev Number: 5 (DW_TAG_typedef)
    <f04>   DW_AT_name        : (indirect string, offset: 0xfcab9): GPIO_PinState
    <f08>   DW_AT_decl_file   : 7
    <f09>   DW_AT_decl_line   : 72
    <f0a>   DW_AT_decl_column : 3
    <f0b>   DW_AT_type        : <0xeea>
 <1><f0f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f10>   DW_AT_byte_size   : 32
    <f11>   DW_AT_decl_file   : 8
    <f12>   DW_AT_decl_line   : 46
    <f13>   DW_AT_decl_column : 9
    <f13>   DW_AT_sibling     : <0xf80>
 <2><f17>: Abbrev Number: 3 (DW_TAG_member)
    <f18>   DW_AT_name        : (indirect string, offset: 0xe7672): Request
    <f1c>   DW_AT_decl_file   : 8
    <f1d>   DW_AT_decl_line   : 48
    <f1e>   DW_AT_decl_column : 12
    <f1f>   DW_AT_type        : <0x3ad>
    <f23>   DW_AT_data_member_location: 0
 <2><f24>: Abbrev Number: 3 (DW_TAG_member)
    <f25>   DW_AT_name        : (indirect string, offset: 0x61090): Direction
    <f29>   DW_AT_decl_file   : 8
    <f2a>   DW_AT_decl_line   : 51
    <f2b>   DW_AT_decl_column : 12
    <f2c>   DW_AT_type        : <0x3ad>
    <f30>   DW_AT_data_member_location: 4
 <2><f31>: Abbrev Number: 3 (DW_TAG_member)
    <f32>   DW_AT_name        : (indirect string, offset: 0x1221e): PeriphInc
    <f36>   DW_AT_decl_file   : 8
    <f37>   DW_AT_decl_line   : 55
    <f38>   DW_AT_decl_column : 12
    <f39>   DW_AT_type        : <0x3ad>
    <f3d>   DW_AT_data_member_location: 8
 <2><f3e>: Abbrev Number: 3 (DW_TAG_member)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x2a23c): MemInc
    <f43>   DW_AT_decl_file   : 8
    <f44>   DW_AT_decl_line   : 58
    <f45>   DW_AT_decl_column : 12
    <f46>   DW_AT_type        : <0x3ad>
    <f4a>   DW_AT_data_member_location: 12
 <2><f4b>: Abbrev Number: 3 (DW_TAG_member)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x823d5): PeriphDataAlignment
    <f50>   DW_AT_decl_file   : 8
    <f51>   DW_AT_decl_line   : 61
    <f52>   DW_AT_decl_column : 12
    <f53>   DW_AT_type        : <0x3ad>
    <f57>   DW_AT_data_member_location: 16
 <2><f58>: Abbrev Number: 3 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0xe9036): MemDataAlignment
    <f5d>   DW_AT_decl_file   : 8
    <f5e>   DW_AT_decl_line   : 64
    <f5f>   DW_AT_decl_column : 12
    <f60>   DW_AT_type        : <0x3ad>
    <f64>   DW_AT_data_member_location: 20
 <2><f65>: Abbrev Number: 3 (DW_TAG_member)
    <f66>   DW_AT_name        : (indirect string, offset: 0x1047c0): Mode
    <f6a>   DW_AT_decl_file   : 8
    <f6b>   DW_AT_decl_line   : 67
    <f6c>   DW_AT_decl_column : 12
    <f6d>   DW_AT_type        : <0x3ad>
    <f71>   DW_AT_data_member_location: 24
 <2><f72>: Abbrev Number: 3 (DW_TAG_member)
    <f73>   DW_AT_name        : (indirect string, offset: 0x10292e): Priority
    <f77>   DW_AT_decl_file   : 8
    <f78>   DW_AT_decl_line   : 72
    <f79>   DW_AT_decl_column : 12
    <f7a>   DW_AT_type        : <0x3ad>
    <f7e>   DW_AT_data_member_location: 28
 <2><f7f>: Abbrev Number: 0
 <1><f80>: Abbrev Number: 5 (DW_TAG_typedef)
    <f81>   DW_AT_name        : (indirect string, offset: 0x47246): DMA_InitTypeDef
    <f85>   DW_AT_decl_file   : 8
    <f86>   DW_AT_decl_line   : 74
    <f87>   DW_AT_decl_column : 3
    <f88>   DW_AT_type        : <0xf0f>
 <1><f8c>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <f8d>   DW_AT_encoding    : 7	(unsigned)
    <f8e>   DW_AT_byte_size   : 1
    <f8e>   DW_AT_type        : <0x31a>
    <f92>   DW_AT_decl_file   : 8
    <f93>   DW_AT_decl_line   : 80
    <f94>   DW_AT_decl_column : 1
    <f94>   DW_AT_sibling     : <0xfb1>
 <2><f98>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f99>   DW_AT_name        : (indirect string, offset: 0xc0a96): HAL_DMA_STATE_RESET
    <f9d>   DW_AT_const_value : 0
 <2><f9e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x487f6): HAL_DMA_STATE_READY
    <fa3>   DW_AT_const_value : 1
 <2><fa4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fa5>   DW_AT_name        : (indirect string, offset: 0xb4738): HAL_DMA_STATE_BUSY
    <fa9>   DW_AT_const_value : 2
 <2><faa>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fab>   DW_AT_name        : (indirect string, offset: 0xfd041): HAL_DMA_STATE_TIMEOUT
    <faf>   DW_AT_const_value : 3
 <2><fb0>: Abbrev Number: 0
 <1><fb1>: Abbrev Number: 5 (DW_TAG_typedef)
    <fb2>   DW_AT_name        : (indirect string, offset: 0x8fc89): HAL_DMA_StateTypeDef
    <fb6>   DW_AT_decl_file   : 8
    <fb7>   DW_AT_decl_line   : 85
    <fb8>   DW_AT_decl_column : 3
    <fb9>   DW_AT_type        : <0xf8c>
 <1><fbd>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <fbe>   DW_AT_type        : <0xfb1>
 <1><fc2>: Abbrev Number: 29 (DW_TAG_structure_type)
    <fc3>   DW_AT_name        : (indirect string, offset: 0xb4cef): __DMA_HandleTypeDef
    <fc7>   DW_AT_byte_size   : 96
    <fc8>   DW_AT_decl_file   : 8
    <fc9>   DW_AT_decl_line   : 113
    <fca>   DW_AT_decl_column : 16
    <fcb>   DW_AT_sibling     : <0x10ba>
 <2><fcf>: Abbrev Number: 3 (DW_TAG_member)
    <fd0>   DW_AT_name        : (indirect string, offset: 0x66300): Instance
    <fd4>   DW_AT_decl_file   : 8
    <fd5>   DW_AT_decl_line   : 115
    <fd6>   DW_AT_decl_column : 27
    <fd7>   DW_AT_type        : <0x10ba>
    <fdb>   DW_AT_data_member_location: 0
 <2><fdc>: Abbrev Number: 3 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x700): Init
    <fe1>   DW_AT_decl_file   : 8
    <fe2>   DW_AT_decl_line   : 117
    <fe3>   DW_AT_decl_column : 25
    <fe4>   DW_AT_type        : <0xf80>
    <fe8>   DW_AT_data_member_location: 4
 <2><fe9>: Abbrev Number: 3 (DW_TAG_member)
    <fea>   DW_AT_name        : (indirect string, offset: 0xb8dd9): Lock
    <fee>   DW_AT_decl_file   : 8
    <fef>   DW_AT_decl_line   : 119
    <ff0>   DW_AT_decl_column : 25
    <ff1>   DW_AT_type        : <0xd45>
    <ff5>   DW_AT_data_member_location: 36
 <2><ff6>: Abbrev Number: 3 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0xb8517): State
    <ffb>   DW_AT_decl_file   : 8
    <ffc>   DW_AT_decl_line   : 121
    <ffd>   DW_AT_decl_column : 30
    <ffe>   DW_AT_type        : <0xfbd>
    <1002>   DW_AT_data_member_location: 37
 <2><1003>: Abbrev Number: 3 (DW_TAG_member)
    <1004>   DW_AT_name        : (indirect string, offset: 0xf4f6e): Parent
    <1008>   DW_AT_decl_file   : 8
    <1009>   DW_AT_decl_line   : 123
    <100a>   DW_AT_decl_column : 26
    <100b>   DW_AT_type        : <0x10bf>
    <100f>   DW_AT_data_member_location: 40
 <2><1010>: Abbrev Number: 3 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0xfff8a): XferCpltCallback
    <1015>   DW_AT_decl_file   : 8
    <1016>   DW_AT_decl_line   : 125
    <1017>   DW_AT_decl_column : 11
    <1018>   DW_AT_type        : <0x10d1>
    <101c>   DW_AT_data_member_location: 44
 <2><101d>: Abbrev Number: 3 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0xc8820): XferHalfCpltCallback
    <1022>   DW_AT_decl_file   : 8
    <1023>   DW_AT_decl_line   : 127
    <1024>   DW_AT_decl_column : 11
    <1025>   DW_AT_type        : <0x10d1>
    <1029>   DW_AT_data_member_location: 48
 <2><102a>: Abbrev Number: 3 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0x26b05): XferErrorCallback
    <102f>   DW_AT_decl_file   : 8
    <1030>   DW_AT_decl_line   : 129
    <1031>   DW_AT_decl_column : 11
    <1032>   DW_AT_type        : <0x10d1>
    <1036>   DW_AT_data_member_location: 52
 <2><1037>: Abbrev Number: 3 (DW_TAG_member)
    <1038>   DW_AT_name        : (indirect string, offset: 0xf0bc3): XferAbortCallback
    <103c>   DW_AT_decl_file   : 8
    <103d>   DW_AT_decl_line   : 131
    <103e>   DW_AT_decl_column : 11
    <103f>   DW_AT_type        : <0x10d1>
    <1043>   DW_AT_data_member_location: 56
 <2><1044>: Abbrev Number: 3 (DW_TAG_member)
    <1045>   DW_AT_name        : (indirect string, offset: 0xfb437): ErrorCode
    <1049>   DW_AT_decl_file   : 8
    <104a>   DW_AT_decl_line   : 133
    <104b>   DW_AT_decl_column : 26
    <104c>   DW_AT_type        : <0x3b9>
    <1050>   DW_AT_data_member_location: 60
 <2><1051>: Abbrev Number: 3 (DW_TAG_member)
    <1052>   DW_AT_name        : (indirect string, offset: 0x69eee): DmaBaseAddress
    <1056>   DW_AT_decl_file   : 8
    <1057>   DW_AT_decl_line   : 135
    <1058>   DW_AT_decl_column : 27
    <1059>   DW_AT_type        : <0x10d6>
    <105d>   DW_AT_data_member_location: 64
 <2><105e>: Abbrev Number: 3 (DW_TAG_member)
    <105f>   DW_AT_name        : (indirect string, offset: 0xef3e0): ChannelIndex
    <1063>   DW_AT_decl_file   : 8
    <1064>   DW_AT_decl_line   : 137
    <1065>   DW_AT_decl_column : 26
    <1066>   DW_AT_type        : <0x3ad>
    <106a>   DW_AT_data_member_location: 68
 <2><106b>: Abbrev Number: 3 (DW_TAG_member)
    <106c>   DW_AT_name        : (indirect string, offset: 0x65a96): DMAmuxChannel
    <1070>   DW_AT_decl_file   : 8
    <1071>   DW_AT_decl_line   : 139
    <1072>   DW_AT_decl_column : 37
    <1073>   DW_AT_type        : <0x10db>
    <1077>   DW_AT_data_member_location: 72
 <2><1078>: Abbrev Number: 3 (DW_TAG_member)
    <1079>   DW_AT_name        : (indirect string, offset: 0x60411): DMAmuxChannelStatus
    <107d>   DW_AT_decl_file   : 8
    <107e>   DW_AT_decl_line   : 141
    <107f>   DW_AT_decl_column : 37
    <1080>   DW_AT_type        : <0x10e0>
    <1084>   DW_AT_data_member_location: 76
 <2><1085>: Abbrev Number: 3 (DW_TAG_member)
    <1086>   DW_AT_name        : (indirect string, offset: 0xc5271): DMAmuxChannelStatusMask
    <108a>   DW_AT_decl_file   : 8
    <108b>   DW_AT_decl_line   : 143
    <108c>   DW_AT_decl_column : 36
    <108d>   DW_AT_type        : <0x3ad>
    <1091>   DW_AT_data_member_location: 80
 <2><1092>: Abbrev Number: 3 (DW_TAG_member)
    <1093>   DW_AT_name        : (indirect string, offset: 0x802b4): DMAmuxRequestGen
    <1097>   DW_AT_decl_file   : 8
    <1098>   DW_AT_decl_line   : 145
    <1099>   DW_AT_decl_column : 37
    <109a>   DW_AT_type        : <0x10e5>
    <109e>   DW_AT_data_member_location: 84
 <2><109f>: Abbrev Number: 3 (DW_TAG_member)
    <10a0>   DW_AT_name        : (indirect string, offset: 0xccd05): DMAmuxRequestGenStatus
    <10a4>   DW_AT_decl_file   : 8
    <10a5>   DW_AT_decl_line   : 147
    <10a6>   DW_AT_decl_column : 37
    <10a7>   DW_AT_type        : <0x10ea>
    <10ab>   DW_AT_data_member_location: 88
 <2><10ac>: Abbrev Number: 3 (DW_TAG_member)
    <10ad>   DW_AT_name        : (indirect string, offset: 0xd0c7a): DMAmuxRequestGenStatusMask
    <10b1>   DW_AT_decl_file   : 8
    <10b2>   DW_AT_decl_line   : 149
    <10b3>   DW_AT_decl_column : 36
    <10b4>   DW_AT_type        : <0x3ad>
    <10b8>   DW_AT_data_member_location: 92
 <2><10b9>: Abbrev Number: 0
 <1><10ba>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10bb>   DW_AT_byte_size   : 4
    <10bb>   DW_AT_type        : <0x420>
 <1><10bf>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <10c0>   DW_AT_byte_size   : 4
 <1><10c1>: Abbrev Number: 31 (DW_TAG_subroutine_type)
    <10c2>   DW_AT_prototyped  : 1
    <10c2>   DW_AT_sibling     : <0x10cc>
 <2><10c6>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <10c7>   DW_AT_type        : <0x10cc>
 <2><10cb>: Abbrev Number: 0
 <1><10cc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10cd>   DW_AT_byte_size   : 4
    <10cd>   DW_AT_type        : <0xfc2>
 <1><10d1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10d2>   DW_AT_byte_size   : 4
    <10d2>   DW_AT_type        : <0x10c1>
 <1><10d6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10d7>   DW_AT_byte_size   : 4
    <10d7>   DW_AT_type        : <0x452>
 <1><10db>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10dc>   DW_AT_byte_size   : 4
    <10dc>   DW_AT_type        : <0x476>
 <1><10e0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10e1>   DW_AT_byte_size   : 4
    <10e1>   DW_AT_type        : <0x4a7>
 <1><10e5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10e6>   DW_AT_byte_size   : 4
    <10e6>   DW_AT_type        : <0x4cc>
 <1><10ea>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10eb>   DW_AT_byte_size   : 4
    <10eb>   DW_AT_type        : <0x4ff>
 <1><10ef>: Abbrev Number: 5 (DW_TAG_typedef)
    <10f0>   DW_AT_name        : (indirect string, offset: 0xb4cf1): DMA_HandleTypeDef
    <10f4>   DW_AT_decl_file   : 8
    <10f5>   DW_AT_decl_line   : 151
    <10f6>   DW_AT_decl_column : 3
    <10f7>   DW_AT_type        : <0xfc2>
 <1><10fb>: Abbrev Number: 13 (DW_TAG_structure_type)
    <10fc>   DW_AT_byte_size   : 20
    <10fd>   DW_AT_decl_file   : 9
    <10fe>   DW_AT_decl_line   : 61
    <10ff>   DW_AT_decl_column : 9
    <10ff>   DW_AT_sibling     : <0x1145>
 <2><1103>: Abbrev Number: 3 (DW_TAG_member)
    <1104>   DW_AT_name        : (indirect string, offset: 0x269b8): HRTIMInterruptRequests
    <1108>   DW_AT_decl_file   : 9
    <1109>   DW_AT_decl_line   : 63
    <110a>   DW_AT_decl_column : 12
    <110b>   DW_AT_type        : <0x3ad>
    <110f>   DW_AT_data_member_location: 0
 <2><1110>: Abbrev Number: 3 (DW_TAG_member)
    <1111>   DW_AT_name        : (indirect string, offset: 0xd8d7c): SyncOptions
    <1115>   DW_AT_decl_file   : 9
    <1116>   DW_AT_decl_line   : 65
    <1117>   DW_AT_decl_column : 12
    <1118>   DW_AT_type        : <0x3ad>
    <111c>   DW_AT_data_member_location: 4
 <2><111d>: Abbrev Number: 3 (DW_TAG_member)
    <111e>   DW_AT_name        : (indirect string, offset: 0x2734f): SyncInputSource
    <1122>   DW_AT_decl_file   : 9
    <1123>   DW_AT_decl_line   : 69
    <1124>   DW_AT_decl_column : 12
    <1125>   DW_AT_type        : <0x3ad>
    <1129>   DW_AT_data_member_location: 8
 <2><112a>: Abbrev Number: 3 (DW_TAG_member)
    <112b>   DW_AT_name        : (indirect string, offset: 0x690e4): SyncOutputSource
    <112f>   DW_AT_decl_file   : 9
    <1130>   DW_AT_decl_line   : 72
    <1131>   DW_AT_decl_column : 12
    <1132>   DW_AT_type        : <0x3ad>
    <1136>   DW_AT_data_member_location: 12
 <2><1137>: Abbrev Number: 3 (DW_TAG_member)
    <1138>   DW_AT_name        : (indirect string, offset: 0xfe159): SyncOutputPolarity
    <113c>   DW_AT_decl_file   : 9
    <113d>   DW_AT_decl_line   : 75
    <113e>   DW_AT_decl_column : 12
    <113f>   DW_AT_type        : <0x3ad>
    <1143>   DW_AT_data_member_location: 16
 <2><1144>: Abbrev Number: 0
 <1><1145>: Abbrev Number: 5 (DW_TAG_typedef)
    <1146>   DW_AT_name        : (indirect string, offset: 0x860b3): HRTIM_InitTypeDef
    <114a>   DW_AT_decl_file   : 9
    <114b>   DW_AT_decl_line   : 78
    <114c>   DW_AT_decl_column : 3
    <114d>   DW_AT_type        : <0x10fb>
 <1><1151>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <1152>   DW_AT_encoding    : 7	(unsigned)
    <1153>   DW_AT_byte_size   : 1
    <1153>   DW_AT_type        : <0x31a>
    <1157>   DW_AT_decl_file   : 9
    <1158>   DW_AT_decl_line   : 84
    <1159>   DW_AT_decl_column : 1
    <1159>   DW_AT_sibling     : <0x117c>
 <2><115d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <115e>   DW_AT_name        : (indirect string, offset: 0xd7dd4): HAL_HRTIM_STATE_RESET
    <1162>   DW_AT_const_value : 0
 <2><1163>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1164>   DW_AT_name        : (indirect string, offset: 0x1faf1): HAL_HRTIM_STATE_READY
    <1168>   DW_AT_const_value : 1
 <2><1169>: Abbrev Number: 2 (DW_TAG_enumerator)
    <116a>   DW_AT_name        : (indirect string, offset: 0xaf620): HAL_HRTIM_STATE_BUSY
    <116e>   DW_AT_const_value : 2
 <2><116f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1170>   DW_AT_name        : (indirect string, offset: 0xf689c): HAL_HRTIM_STATE_TIMEOUT
    <1174>   DW_AT_const_value : 6
 <2><1175>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1176>   DW_AT_name        : (indirect string, offset: 0xf494b): HAL_HRTIM_STATE_ERROR
    <117a>   DW_AT_const_value : 7
 <2><117b>: Abbrev Number: 0
 <1><117c>: Abbrev Number: 5 (DW_TAG_typedef)
    <117d>   DW_AT_name        : (indirect string, offset: 0x716a9): HAL_HRTIM_StateTypeDef
    <1181>   DW_AT_decl_file   : 9
    <1182>   DW_AT_decl_line   : 93
    <1183>   DW_AT_decl_column : 3
    <1184>   DW_AT_type        : <0x1151>
 <1><1188>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <1189>   DW_AT_type        : <0x117c>
 <1><118d>: Abbrev Number: 13 (DW_TAG_structure_type)
    <118e>   DW_AT_byte_size   : 28
    <118f>   DW_AT_decl_file   : 9
    <1190>   DW_AT_decl_line   : 98
    <1191>   DW_AT_decl_column : 9
    <1191>   DW_AT_sibling     : <0x11f1>
 <2><1195>: Abbrev Number: 3 (DW_TAG_member)
    <1196>   DW_AT_name        : (indirect string, offset: 0x55e6): CaptureTrigger1
    <119a>   DW_AT_decl_file   : 9
    <119b>   DW_AT_decl_line   : 100
    <119c>   DW_AT_decl_column : 12
    <119d>   DW_AT_type        : <0x3ad>
    <11a1>   DW_AT_data_member_location: 0
 <2><11a2>: Abbrev Number: 3 (DW_TAG_member)
    <11a3>   DW_AT_name        : (indirect string, offset: 0x55f6): CaptureTrigger2
    <11a7>   DW_AT_decl_file   : 9
    <11a8>   DW_AT_decl_line   : 103
    <11a9>   DW_AT_decl_column : 12
    <11aa>   DW_AT_type        : <0x3ad>
    <11ae>   DW_AT_data_member_location: 4
 <2><11af>: Abbrev Number: 3 (DW_TAG_member)
    <11b0>   DW_AT_name        : (indirect string, offset: 0x269bd): InterruptRequests
    <11b4>   DW_AT_decl_file   : 9
    <11b5>   DW_AT_decl_line   : 106
    <11b6>   DW_AT_decl_column : 12
    <11b7>   DW_AT_type        : <0x3ad>
    <11bb>   DW_AT_data_member_location: 8
 <2><11bc>: Abbrev Number: 3 (DW_TAG_member)
    <11bd>   DW_AT_name        : (indirect string, offset: 0x45a70): DMARequests
    <11c1>   DW_AT_decl_file   : 9
    <11c2>   DW_AT_decl_line   : 107
    <11c3>   DW_AT_decl_column : 12
    <11c4>   DW_AT_type        : <0x3ad>
    <11c8>   DW_AT_data_member_location: 12
 <2><11c9>: Abbrev Number: 3 (DW_TAG_member)
    <11ca>   DW_AT_name        : (indirect string, offset: 0x991e7): DMASrcAddress
    <11ce>   DW_AT_decl_file   : 9
    <11cf>   DW_AT_decl_line   : 108
    <11d0>   DW_AT_decl_column : 12
    <11d1>   DW_AT_type        : <0x3ad>
    <11d5>   DW_AT_data_member_location: 16
 <2><11d6>: Abbrev Number: 3 (DW_TAG_member)
    <11d7>   DW_AT_name        : (indirect string, offset: 0x6b895): DMADstAddress
    <11db>   DW_AT_decl_file   : 9
    <11dc>   DW_AT_decl_line   : 109
    <11dd>   DW_AT_decl_column : 12
    <11de>   DW_AT_type        : <0x3ad>
    <11e2>   DW_AT_data_member_location: 20
 <2><11e3>: Abbrev Number: 3 (DW_TAG_member)
    <11e4>   DW_AT_name        : (indirect string, offset: 0x7d1f4): DMASize
    <11e8>   DW_AT_decl_file   : 9
    <11e9>   DW_AT_decl_line   : 110
    <11ea>   DW_AT_decl_column : 12
    <11eb>   DW_AT_type        : <0x3ad>
    <11ef>   DW_AT_data_member_location: 24
 <2><11f0>: Abbrev Number: 0
 <1><11f1>: Abbrev Number: 5 (DW_TAG_typedef)
    <11f2>   DW_AT_name        : (indirect string, offset: 0x1ae64): HRTIM_TimerParamTypeDef
    <11f6>   DW_AT_decl_file   : 9
    <11f7>   DW_AT_decl_line   : 111
    <11f8>   DW_AT_decl_column : 3
    <11f9>   DW_AT_type        : <0x118d>
 <1><11fd>: Abbrev Number: 13 (DW_TAG_structure_type)
    <11fe>   DW_AT_byte_size   : 252
    <11ff>   DW_AT_decl_file   : 9
    <1200>   DW_AT_decl_line   : 119
    <1201>   DW_AT_decl_column : 9
    <1201>   DW_AT_sibling     : <0x12a2>
 <2><1205>: Abbrev Number: 3 (DW_TAG_member)
    <1206>   DW_AT_name        : (indirect string, offset: 0x66300): Instance
    <120a>   DW_AT_decl_file   : 9
    <120b>   DW_AT_decl_line   : 122
    <120c>   DW_AT_decl_column : 32
    <120d>   DW_AT_type        : <0x12a2>
    <1211>   DW_AT_data_member_location: 0
 <2><1212>: Abbrev Number: 3 (DW_TAG_member)
    <1213>   DW_AT_name        : (indirect string, offset: 0x700): Init
    <1217>   DW_AT_decl_file   : 9
    <1218>   DW_AT_decl_line   : 124
    <1219>   DW_AT_decl_column : 32
    <121a>   DW_AT_type        : <0x1145>
    <121e>   DW_AT_data_member_location: 4
 <2><121f>: Abbrev Number: 3 (DW_TAG_member)
    <1220>   DW_AT_name        : (indirect string, offset: 0x9919a): TimerParam
    <1224>   DW_AT_decl_file   : 9
    <1225>   DW_AT_decl_line   : 126
    <1226>   DW_AT_decl_column : 32
    <1227>   DW_AT_type        : <0x12a7>
    <122b>   DW_AT_data_member_location: 24
 <2><122c>: Abbrev Number: 3 (DW_TAG_member)
    <122d>   DW_AT_name        : (indirect string, offset: 0xb8dd9): Lock
    <1231>   DW_AT_decl_file   : 9
    <1232>   DW_AT_decl_line   : 128
    <1233>   DW_AT_decl_column : 32
    <1234>   DW_AT_type        : <0xd45>
    <1238>   DW_AT_data_member_location: 220
 <2><1239>: Abbrev Number: 3 (DW_TAG_member)
    <123a>   DW_AT_name        : (indirect string, offset: 0xb8517): State
    <123e>   DW_AT_decl_file   : 9
    <123f>   DW_AT_decl_line   : 130
    <1240>   DW_AT_decl_column : 32
    <1241>   DW_AT_type        : <0x1188>
    <1245>   DW_AT_data_member_location: 221
 <2><1246>: Abbrev Number: 3 (DW_TAG_member)
    <1247>   DW_AT_name        : (indirect string, offset: 0x356d4): hdmaMaster
    <124b>   DW_AT_decl_file   : 9
    <124c>   DW_AT_decl_line   : 132
    <124d>   DW_AT_decl_column : 32
    <124e>   DW_AT_type        : <0x12b7>
    <1252>   DW_AT_data_member_location: 224
 <2><1253>: Abbrev Number: 3 (DW_TAG_member)
    <1254>   DW_AT_name        : (indirect string, offset: 0xdadd2): hdmaTimerA
    <1258>   DW_AT_decl_file   : 9
    <1259>   DW_AT_decl_line   : 133
    <125a>   DW_AT_decl_column : 32
    <125b>   DW_AT_type        : <0x12b7>
    <125f>   DW_AT_data_member_location: 228
 <2><1260>: Abbrev Number: 3 (DW_TAG_member)
    <1261>   DW_AT_name        : (indirect string, offset: 0x5e9c): hdmaTimerB
    <1265>   DW_AT_decl_file   : 9
    <1266>   DW_AT_decl_line   : 134
    <1267>   DW_AT_decl_column : 32
    <1268>   DW_AT_type        : <0x12b7>
    <126c>   DW_AT_data_member_location: 232
 <2><126d>: Abbrev Number: 3 (DW_TAG_member)
    <126e>   DW_AT_name        : (indirect string, offset: 0x5ecd): hdmaTimerC
    <1272>   DW_AT_decl_file   : 9
    <1273>   DW_AT_decl_line   : 135
    <1274>   DW_AT_decl_column : 32
    <1275>   DW_AT_type        : <0x12b7>
    <1279>   DW_AT_data_member_location: 236
 <2><127a>: Abbrev Number: 3 (DW_TAG_member)
    <127b>   DW_AT_name        : (indirect string, offset: 0xdae33): hdmaTimerD
    <127f>   DW_AT_decl_file   : 9
    <1280>   DW_AT_decl_line   : 136
    <1281>   DW_AT_decl_column : 32
    <1282>   DW_AT_type        : <0x12b7>
    <1286>   DW_AT_data_member_location: 240
 <2><1287>: Abbrev Number: 3 (DW_TAG_member)
    <1288>   DW_AT_name        : (indirect string, offset: 0x350b7): hdmaTimerE
    <128c>   DW_AT_decl_file   : 9
    <128d>   DW_AT_decl_line   : 137
    <128e>   DW_AT_decl_column : 32
    <128f>   DW_AT_type        : <0x12b7>
    <1293>   DW_AT_data_member_location: 244
 <2><1294>: Abbrev Number: 3 (DW_TAG_member)
    <1295>   DW_AT_name        : (indirect string, offset: 0xdae60): hdmaTimerF
    <1299>   DW_AT_decl_file   : 9
    <129a>   DW_AT_decl_line   : 138
    <129b>   DW_AT_decl_column : 32
    <129c>   DW_AT_type        : <0x12b7>
    <12a0>   DW_AT_data_member_location: 248
 <2><12a1>: Abbrev Number: 0
 <1><12a2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <12a3>   DW_AT_byte_size   : 4
    <12a3>   DW_AT_type        : <0xce7>
 <1><12a7>: Abbrev Number: 16 (DW_TAG_array_type)
    <12a8>   DW_AT_type        : <0x11f1>
    <12ac>   DW_AT_sibling     : <0x12b7>
 <2><12b0>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <12b1>   DW_AT_type        : <0x382>
    <12b5>   DW_AT_upper_bound : 6
 <2><12b6>: Abbrev Number: 0
 <1><12b7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <12b8>   DW_AT_byte_size   : 4
    <12b8>   DW_AT_type        : <0x10ef>
 <1><12bc>: Abbrev Number: 5 (DW_TAG_typedef)
    <12bd>   DW_AT_name        : (indirect string, offset: 0xefb3e): HRTIM_HandleTypeDef
    <12c1>   DW_AT_decl_file   : 9
    <12c2>   DW_AT_decl_line   : 172
    <12c3>   DW_AT_decl_column : 3
    <12c4>   DW_AT_type        : <0x11fd>
 <1><12c8>: Abbrev Number: 13 (DW_TAG_structure_type)
    <12c9>   DW_AT_byte_size   : 16
    <12ca>   DW_AT_decl_file   : 9
    <12cb>   DW_AT_decl_line   : 177
    <12cc>   DW_AT_decl_column : 9
    <12cc>   DW_AT_sibling     : <0x1305>
 <2><12d0>: Abbrev Number: 3 (DW_TAG_member)
    <12d1>   DW_AT_name        : (indirect string, offset: 0xc9383): Period
    <12d5>   DW_AT_decl_file   : 9
    <12d6>   DW_AT_decl_line   : 179
    <12d7>   DW_AT_decl_column : 12
    <12d8>   DW_AT_type        : <0x3ad>
    <12dc>   DW_AT_data_member_location: 0
 <2><12dd>: Abbrev Number: 3 (DW_TAG_member)
    <12de>   DW_AT_name        : (indirect string, offset: 0xb61e1): RepetitionCounter
    <12e2>   DW_AT_decl_file   : 9
    <12e3>   DW_AT_decl_line   : 182
    <12e4>   DW_AT_decl_column : 12
    <12e5>   DW_AT_type        : <0x3ad>
    <12e9>   DW_AT_data_member_location: 4
 <2><12ea>: Abbrev Number: 3 (DW_TAG_member)
    <12eb>   DW_AT_name        : (indirect string, offset: 0xcc254): PrescalerRatio
    <12ef>   DW_AT_decl_file   : 9
    <12f0>   DW_AT_decl_line   : 184
    <12f1>   DW_AT_decl_column : 12
    <12f2>   DW_AT_type        : <0x3ad>
    <12f6>   DW_AT_data_member_location: 8
 <2><12f7>: Abbrev Number: 3 (DW_TAG_member)
    <12f8>   DW_AT_name        : (indirect string, offset: 0x1047c0): Mode
    <12fc>   DW_AT_decl_file   : 9
    <12fd>   DW_AT_decl_line   : 186
    <12fe>   DW_AT_decl_column : 12
    <12ff>   DW_AT_type        : <0x3ad>
    <1303>   DW_AT_data_member_location: 12
 <2><1304>: Abbrev Number: 0
 <1><1305>: Abbrev Number: 5 (DW_TAG_typedef)
    <1306>   DW_AT_name        : (indirect string, offset: 0xf565a): HRTIM_TimeBaseCfgTypeDef
    <130a>   DW_AT_decl_file   : 9
    <130b>   DW_AT_decl_line   : 188
    <130c>   DW_AT_decl_column : 3
    <130d>   DW_AT_type        : <0x12c8>
 <1><1311>: Abbrev Number: 18 (DW_TAG_const_type)
    <1312>   DW_AT_type        : <0x1305>
 <1><1316>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1317>   DW_AT_byte_size   : 96
    <1318>   DW_AT_decl_file   : 9
    <1319>   DW_AT_decl_line   : 257
    <131b>   DW_AT_decl_column : 9
    <131b>   DW_AT_sibling     : <0x1470>
 <2><131f>: Abbrev Number: 1 (DW_TAG_member)
    <1320>   DW_AT_name        : (indirect string, offset: 0x269bd): InterruptRequests
    <1324>   DW_AT_decl_file   : 9
    <1325>   DW_AT_decl_line   : 259
    <1327>   DW_AT_decl_column : 12
    <1328>   DW_AT_type        : <0x3ad>
    <132c>   DW_AT_data_member_location: 0
 <2><132d>: Abbrev Number: 1 (DW_TAG_member)
    <132e>   DW_AT_name        : (indirect string, offset: 0x45a70): DMARequests
    <1332>   DW_AT_decl_file   : 9
    <1333>   DW_AT_decl_line   : 263
    <1335>   DW_AT_decl_column : 12
    <1336>   DW_AT_type        : <0x3ad>
    <133a>   DW_AT_data_member_location: 4
 <2><133b>: Abbrev Number: 1 (DW_TAG_member)
    <133c>   DW_AT_name        : (indirect string, offset: 0x991e7): DMASrcAddress
    <1340>   DW_AT_decl_file   : 9
    <1341>   DW_AT_decl_line   : 267
    <1343>   DW_AT_decl_column : 12
    <1344>   DW_AT_type        : <0x3ad>
    <1348>   DW_AT_data_member_location: 8
 <2><1349>: Abbrev Number: 1 (DW_TAG_member)
    <134a>   DW_AT_name        : (indirect string, offset: 0x6b895): DMADstAddress
    <134e>   DW_AT_decl_file   : 9
    <134f>   DW_AT_decl_line   : 269
    <1351>   DW_AT_decl_column : 12
    <1352>   DW_AT_type        : <0x3ad>
    <1356>   DW_AT_data_member_location: 12
 <2><1357>: Abbrev Number: 1 (DW_TAG_member)
    <1358>   DW_AT_name        : (indirect string, offset: 0x7d1f4): DMASize
    <135c>   DW_AT_decl_file   : 9
    <135d>   DW_AT_decl_line   : 271
    <135f>   DW_AT_decl_column : 12
    <1360>   DW_AT_type        : <0x3ad>
    <1364>   DW_AT_data_member_location: 16
 <2><1365>: Abbrev Number: 1 (DW_TAG_member)
    <1366>   DW_AT_name        : (indirect string, offset: 0x13434): HalfModeEnable
    <136a>   DW_AT_decl_file   : 9
    <136b>   DW_AT_decl_line   : 273
    <136d>   DW_AT_decl_column : 12
    <136e>   DW_AT_type        : <0x3ad>
    <1372>   DW_AT_data_member_location: 20
 <2><1373>: Abbrev Number: 1 (DW_TAG_member)
    <1374>   DW_AT_name        : (indirect string, offset: 0xa02fc): InterleavedMode
    <1378>   DW_AT_decl_file   : 9
    <1379>   DW_AT_decl_line   : 276
    <137b>   DW_AT_decl_column : 12
    <137c>   DW_AT_type        : <0x3ad>
    <1380>   DW_AT_data_member_location: 24
 <2><1381>: Abbrev Number: 1 (DW_TAG_member)
    <1382>   DW_AT_name        : (indirect string, offset: 0xef650): StartOnSync
    <1386>   DW_AT_decl_file   : 9
    <1387>   DW_AT_decl_line   : 279
    <1389>   DW_AT_decl_column : 12
    <138a>   DW_AT_type        : <0x3ad>
    <138e>   DW_AT_data_member_location: 28
 <2><138f>: Abbrev Number: 1 (DW_TAG_member)
    <1390>   DW_AT_name        : (indirect string, offset: 0xa7d8): ResetOnSync
    <1394>   DW_AT_decl_file   : 9
    <1395>   DW_AT_decl_line   : 282
    <1397>   DW_AT_decl_column : 12
    <1398>   DW_AT_type        : <0x3ad>
    <139c>   DW_AT_data_member_location: 32
 <2><139d>: Abbrev Number: 1 (DW_TAG_member)
    <139e>   DW_AT_name        : (indirect string, offset: 0xdeb9b): DACSynchro
    <13a2>   DW_AT_decl_file   : 9
    <13a3>   DW_AT_decl_line   : 285
    <13a5>   DW_AT_decl_column : 12
    <13a6>   DW_AT_type        : <0x3ad>
    <13aa>   DW_AT_data_member_location: 36
 <2><13ab>: Abbrev Number: 1 (DW_TAG_member)
